[Killed] ArrayDeclaration
src/core/acquire/state-machine.ts:39:55
 // ============================================================================
 
 /** Authuser values cycled for multi-account Drive access. */
-export const AUTHUSER_CANDIDATES: readonly number[] = [0, 1, 2, 3, 4, 5, 6, 7, 8, 9];
+export const AUTHUSER_CANDIDATES: readonly number[] = [];
 
 /** Wall-clock budget for ONE acquisition attempt before the deadline event. */
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:109:62
 
 const ATTEMPT_PHASES = ['direct', 'drive-auth', 'bypass-tab'] as const;
 
-function isAttemptPhase(state: AcquireMachineState): boolean {
-  return (ATTEMPT_PHASES as readonly string[]).includes(state.phase);
-}
+function isAttemptPhase(state: AcquireMachineState): boolean {}
 
 function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected [ { type: 'settle', …(1) } ] to deep equally contain { type: 'clear-deadline' }

[Killed] BlockStatement
src/core/acquire/state-machine.ts:113:88
   return (ATTEMPT_PHASES as readonly string[]).includes(state.phase);
 }
 
-function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
-  return [
-    ...(isAttemptPhase(state) ? [{ type: 'clear-deadline' } as const] : []),
-    { type: 'settle', outcome },
-  ];
-}
+function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {}
 
 /** Advance to drive-auth (or out of candidates) and emit the next attempt. */
killedBy: P2 authuser sweep boundedness exhausting every candidate settles with auth-exhausted exactly once
statusReason: Property failed after 1 tests
{ seed: -1283522073, path: "0", endOnFailure: true }
Counterexample: [new Set([])]
Shrunk 0 time(s)

Hint: Enable verbose mode in order to have the list of all failing values encountered during the run

[Killed] ArrayDeclaration
src/core/acquire/state-machine.ts:114:10
 }
 
 function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
-  return [
-    ...(isAttemptPhase(state) ? [{ type: 'clear-deadline' } as const] : []),
-    { type: 'settle', outcome },
-  ];
+  return [];
 }
 
killedBy: PLANNED → DIRECT phase a start failure on a non-drive file retries once, then settles browser-fail
statusReason: expected [] to deep equally contain { type: 'settle', …(1) }

[Killed] ArrayDeclaration
src/core/acquire/state-machine.ts:115:33
 
 function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
   return [
-    ...(isAttemptPhase(state) ? [{ type: 'clear-deadline' } as const] : []),
+    ...(isAttemptPhase(state) ? [] : []),
     { type: 'settle', outcome },
   ];
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected [ { type: 'settle', …(1) } ] to deep equally contain { type: 'clear-deadline' }

[Killed] StringLiteral
src/core/acquire/state-machine.ts:116:13
 function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
   return [
     ...(isAttemptPhase(state) ? [{ type: 'clear-deadline' } as const] : []),
-    { type: 'settle', outcome },
+    { type: "", outcome },
   ];
 }
killedBy: PLANNED → DIRECT phase a start failure on a non-drive file retries once, then settles browser-fail
statusReason: expected [ { type: 'clear-deadline' }, …(1) ] to deep equally contain { type: 'settle', …(1) }

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:116:5
 function settled(state: AcquireMachineState, outcome: AcquireOutcome): AcquireEffect[] {
   return [
     ...(isAttemptPhase(state) ? [{ type: 'clear-deadline' } as const] : []),
-    { type: 'settle', outcome },
+    {},
   ];
 }
killedBy: PLANNED → DIRECT phase a start failure on a non-drive file retries once, then settles browser-fail
statusReason: expected [ { type: 'clear-deadline' }, {} ] to deep equally contain { type: 'settle', …(1) }

[Killed] BlockStatement
src/core/acquire/state-machine.ts:124:3
 function rotateAuthUser(state: AcquireMachineState): {
   state: AcquireMachineState;
   effects: AcquireEffect[];
-} {
-  const next = AUTHUSER_CANDIDATES.find((n) => !state.attemptedAuthUsers.includes(n));
-  if (next == null) {
-    return {
-      state: { ...state, phase: 'settled', outcome: { status: 'auth-exhausted' } },
-      effects: settled(state, { status: 'auth-exhausted' }),
-    };
-  }
-  const attempted = [...state.attemptedAuthUsers, next];
-  return {
-    state: { ...state, phase: 'drive-auth', authUser: next, attemptedAuthUsers: attempted },
-    effects: [
-      { type: 'begin-strategy', strategy: 'drive-auth', authUser: next },
-      { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-    ],
-  };
-}
+} {}
 
 // Stryker disable all: orphaned transition helper — since the zero-tab
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: Cannot destructure property 'state' of 'nextAcquireState(...)' as it is undefined.

[Killed] BooleanLiteral
src/core/acquire/state-machine.ts:125:48
   state: AcquireMachineState;
   effects: AcquireEffect[];
 } {
-  const next = AUTHUSER_CANDIDATES.find((n) => !state.attemptedAuthUsers.includes(n));
+  const next = AUTHUSER_CANDIDATES.find((n) => state.attemptedAuthUsers.includes(n));
   if (next == null) {
     return {
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] ArrowFunction
src/core/acquire/state-machine.ts:125:41
   state: AcquireMachineState;
   effects: AcquireEffect[];
 } {
-  const next = AUTHUSER_CANDIDATES.find((n) => !state.attemptedAuthUsers.includes(n));
+  const next = AUTHUSER_CANDIDATES.find(() => undefined);
   if (next == null) {
     return {
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:126:7
   effects: AcquireEffect[];
 } {
   const next = AUTHUSER_CANDIDATES.find((n) => !state.attemptedAuthUsers.includes(n));
-  if (next == null) {
+  if (next != null) {
     return {
       state: { ...state, phase: 'settled', outcome: { status: 'auth-exhausted' } },
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:126:21
   effects: AcquireEffect[];
 } {
   const next = AUTHUSER_CANDIDATES.find((n) => !state.attemptedAuthUsers.includes(n));
-  if (next == null) {
-    return {
-      state: { ...state, phase: 'settled', outcome: { status: 'auth-exhausted' } },
-      effects: settled(state, { status: 'auth-exhausted' }),
-    };
-  }
+  if (next == null) {}
   const attempted = [...state.attemptedAuthUsers, next];
   return {
killedBy: DRIVE_AUTH phase — authuser rotation is data exhausting every candidate settles auth-exhausted
statusReason: expected 'drive-auth' to be 'settled' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:137:7
     state: { ...state, phase: 'drive-auth', authUser: next, attemptedAuthUsers: attempted },
     effects: [
       { type: 'begin-strategy', strategy: 'drive-auth', authUser: next },
-      { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
+      {},
     ],
   };
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected [ Array(2) ] to deep equally contain { type: 'set-deadline', ms: 30000 }

[Killed] BlockStatement
src/core/acquire/state-machine.ts:159:87
 }
 // Stryker restore all
 
-function saveOutcome(state: AcquireMachineState, downloadId?: number): AcquireOutcome {
-  const inherited = state.phase === 'direct' || state.phase === 'drive-auth'
-    ? state.downloadId
-    : undefined;
-  return { status: 'saved', downloadId: downloadId ?? inherited };
-}
+function saveOutcome(state: AcquireMachineState, downloadId?: number): AcquireOutcome {}
 
 export function nextAcquireState(
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: Cannot read properties of undefined (reading 'status')

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:160:21
 // Stryker restore all
 
 function saveOutcome(state: AcquireMachineState, downloadId?: number): AcquireOutcome {
-  const inherited = state.phase === 'direct' || state.phase === 'drive-auth'
+  const inherited = true
     ? state.downloadId
     : undefined;
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) saving from a non-attempt phase never inherits a downloadId
statusReason: expected 7 to be undefined

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:160:21
 // Stryker restore all
 
 function saveOutcome(state: AcquireMachineState, downloadId?: number): AcquireOutcome {
-  const inherited = state.phase === 'direct' || state.phase === 'drive-auth'
+  const inherited = state.phase === 'direct' && state.phase === 'drive-auth'
     ? state.downloadId
     : undefined;
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) saved inherits the downloadId recorded by download-started
statusReason: expected undefined to be 42 // Object.is equality

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:163:41
   const inherited = state.phase === 'direct' || state.phase === 'drive-auth'
     ? state.downloadId
     : undefined;
-  return { status: 'saved', downloadId: downloadId ?? inherited };
+  return { status: 'saved', downloadId: downloadId && inherited };
 }
 
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected undefined to be 5 // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:170:7
   state: AcquireMachineState,
   event: AcquireEvent,
 ): { state: AcquireMachineState; effects: AcquireEffect[] } {
-  if (state.phase === 'blocked' || state.phase === 'settled') {
+  if (state.phase !== 'blocked' || state.phase === 'settled') {
     return { state, effects: [] };
   }
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: expected 'requested' to be 'blocked' // Object.is equality

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:170:7
   state: AcquireMachineState,
   event: AcquireEvent,
 ): { state: AcquireMachineState; effects: AcquireEffect[] } {
-  if (state.phase === 'blocked' || state.phase === 'settled') {
+  if (state.phase === 'blocked' && state.phase === 'settled') {
     return { state, effects: [] };
   }
killedBy: terminal guarantees (G6 — no silent deaths) events arriving after settle are ignored (terminal is idempotent)
statusReason: expected { phase: 'settled', …(6) } to be { phase: 'settled', …(6) } // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:171:12
   event: AcquireEvent,
 ): { state: AcquireMachineState; effects: AcquireEffect[] } {
   if (state.phase === 'blocked' || state.phase === 'settled') {
-    return { state, effects: [] };
+    return {};
   }
 
killedBy: terminal guarantees (G6 — no silent deaths) events arriving after settle are ignored (terminal is idempotent)
statusReason: expected undefined to be { phase: 'settled', …(6) } // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:175:22
   }
 
   switch (event.type) {
-    case 'validate': {
-      if (event.ok) return { state, effects: [] };
-      const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
-      return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
-    }
+    case 'validate': {}
 
     case 'plan': {
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:175:5
   }
 
   switch (event.type) {
-    case 'validate': {
-      if (event.ok) return { state, effects: [] };
-      const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
-      return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
-    }
+    case 'validate':
 
     case 'plan': {
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: Cannot read properties of undefined (reading '0')

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:176:11
 
   switch (event.type) {
     case 'validate': {
-      if (event.ok) return { state, effects: [] };
+      if (false) return { state, effects: [] };
       const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
       return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a validated-ok request is a no-op with no effects
statusReason: expected { phase: 'blocked', …(6) } to be { phase: 'direct', …(5) } // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:176:11
 
   switch (event.type) {
     case 'validate': {
-      if (event.ok) return { state, effects: [] };
+      if (true) return { state, effects: [] };
       const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
       return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: expected 'requested' to be 'blocked' // Object.is equality

[Killed] ArrayDeclaration
src/core/acquire/state-machine.ts:178:73
     case 'validate': {
       if (event.ok) return { state, effects: [] };
       const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
-      return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
+      return { state: { ...state, phase: 'blocked', outcome }, effects: [] };
     }
 
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: expected [] to deeply equal [ { type: 'settle', …(1) } ]

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:178:23
     case 'validate': {
       if (event.ok) return { state, effects: [] };
       const outcome: AcquireOutcome = { status: 'blocked', detail: event.reason };
-      return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
+      return { state: {}, effects: [{ type: 'settle', outcome }] };
     }
 
killedBy: REQUESTED phase a failed validation settles blocked, with a settle effect
statusReason: expected undefined to be 'blocked' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:181:5
       return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
     }
 
-    case 'plan': {
-      const planned = {
-        ...state,
-        phase: 'planned' as const,
-        isDrive: event.isDrive,
-        strategies: event.strategies,
-      };
-      const first = event.strategies[0];
-      if (first == null) {
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
-        return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
-      }
-      return {
-        state: planned,
-        effects: [
-          {
-            type: 'begin-strategy',
-            strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
-          },
-          { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-        ],
-      };
-    }
+    case 'plan':
 
     case 'strategy-started': {
killedBy: REQUESTED phase planning moves to planned and orders the first strategy
statusReason: expected 'requested' to be 'planned' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:181:18
       return { state: { ...state, phase: 'blocked', outcome }, effects: [{ type: 'settle', outcome }] };
     }
 
-    case 'plan': {
-      const planned = {
-        ...state,
-        phase: 'planned' as const,
-        isDrive: event.isDrive,
-        strategies: event.strategies,
-      };
-      const first = event.strategies[0];
-      if (first == null) {
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
-        return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
-      }
-      return {
-        state: planned,
-        effects: [
-          {
-            type: 'begin-strategy',
-            strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
-          },
-          { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-        ],
-      };
-    }
+    case 'plan': {}
 
     case 'strategy-started': {
killedBy: REQUESTED phase planning moves to planned and orders the first strategy
statusReason: expected 'requested' to be 'planned' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:189:26
         strategies: event.strategies,
       };
       const first = event.strategies[0];
-      if (first == null) {
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
-        return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
-      }
+      if (first == null) {}
       return {
         state: planned,
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan with no strategies settles failed "no strategy planned" with a bare settle effect
statusReason: expected 'planned' to be 'settled' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:189:11
         strategies: event.strategies,
       };
       const first = event.strategies[0];
-      if (first == null) {
+      if (first != null) {
         const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
         return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
killedBy: REQUESTED phase planning moves to planned and orders the first strategy
statusReason: expected 'settled' to be 'planned' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:190:51
       };
       const first = event.strategies[0];
       if (first == null) {
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
+        const outcome: AcquireOutcome = { status: "", detail: 'no strategy planned' };
         return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
       }
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan with no strategies settles failed "no strategy planned" with a bare settle effect
statusReason: expected '' to be 'failed' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:190:41
       };
       const first = event.strategies[0];
       if (first == null) {
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
+        const outcome: AcquireOutcome = {};
         return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
       }
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan with no strategies settles failed "no strategy planned" with a bare settle effect
statusReason: expected undefined to be 'failed' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:191:86
       const first = event.strategies[0];
       if (first == null) {
         const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
-        return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
+        return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: "", outcome }] };
       }
       return {
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan with no strategies settles failed "no strategy planned" with a bare settle effect
statusReason: expected [ { type: '', outcome: { …(2) } } ] to deeply equal [ { type: 'settle', …(1) } ]

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:193:14
         const outcome: AcquireOutcome = { status: 'failed', detail: 'no strategy planned' };
         return { state: { ...planned, phase: 'settled', outcome }, effects: [{ type: 'settle', outcome }] };
       }
-      return {
-        state: planned,
-        effects: [
-          {
-            type: 'begin-strategy',
-            strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
-          },
-          { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-        ],
-      };
+      return {};
     }
 
killedBy: REQUESTED phase planning moves to planned and orders the first strategy
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:196:11
       return {
         state: planned,
         effects: [
-          {
-            type: 'begin-strategy',
-            strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
-          },
+          {},
           { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
         ],
killedBy: REQUESTED phase planning moves to planned and orders the first strategy
statusReason: expected {} to deeply equal { type: 'begin-strategy', …(2) }

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:199:23
           {
             type: 'begin-strategy',
             strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
+            authUser: true ? state.initialAuthUser : undefined,
           },
           { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan whose first strategy is not direct begins it with no authuser
statusReason: expected { type: 'begin-strategy', …(2) } to deeply equal { type: 'begin-strategy', …(2) }

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:199:23
           {
             type: 'begin-strategy',
             strategy: first,
-            authUser: first === 'direct' ? state.initialAuthUser : undefined,
+            authUser: first !== 'direct' ? state.initialAuthUser : undefined,
           },
           { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
killedBy: REQUESTED phase planning with an initial authuser attempts that authuser first
statusReason: expected { type: 'begin-strategy', …(2) } to deeply equal { type: 'begin-strategy', …(2) }

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:201:11
             strategy: first,
             authUser: first === 'direct' ? state.initialAuthUser : undefined,
           },
-          { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
+          {},
         ],
       };
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan whose first strategy is not direct begins it with no authuser
statusReason: expected {} to deeply equal { type: 'set-deadline', ms: 30000 }

[Killed] StringLiteral
src/core/acquire/state-machine.ts:201:19
             strategy: first,
             authUser: first === 'direct' ? state.initialAuthUser : undefined,
           },
-          { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
+          { type: "", ms: ATTEMPT_DEADLINE_MS },
         ],
       };
killedBy: PLANNED phase — strategy-started and inert edges (S12) a plan whose first strategy is not direct begins it with no authuser
statusReason: expected { type: '', ms: 30000 } to deeply equal { type: 'set-deadline', ms: 30000 }

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:206:5
       };
     }
 
-    case 'strategy-started': {
-      // The engine reports the planned strategy actually beginning — the
-      // planned phase is never a dead state.
-      if (state.phase !== 'planned') break;
-      if (event.strategy === 'direct') {
-        return {
-          state: { ...state, phase: 'direct', authUser: state.initialAuthUser },
-          effects: [],
-        };
-      }
-      if (event.strategy === 'drive-auth') {
-        return { state: { ...state, phase: 'drive-auth' }, effects: [] };
-      }
-      break;
-    }
+    case 'strategy-started':
 
     case 'download-started': {
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: expected 'planned' to be 'direct' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:206:30
       };
     }
 
-    case 'strategy-started': {
-      // The engine reports the planned strategy actually beginning — the
-      // planned phase is never a dead state.
-      if (state.phase !== 'planned') break;
-      if (event.strategy === 'direct') {
-        return {
-          state: { ...state, phase: 'direct', authUser: state.initialAuthUser },
-          effects: [],
-        };
-      }
-      if (event.strategy === 'drive-auth') {
-        return { state: { ...state, phase: 'drive-auth' }, effects: [] };
-      }
-      break;
-    }
+    case 'strategy-started': {}
 
     case 'download-started': {
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: expected 'planned' to be 'direct' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:209:11
     case 'strategy-started': {
       // The engine reports the planned strategy actually beginning — the
       // planned phase is never a dead state.
-      if (state.phase !== 'planned') break;
+      if (state.phase === 'planned') break;
       if (event.strategy === 'direct') {
         return {
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: expected 'planned' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:209:11
     case 'strategy-started': {
       // The engine reports the planned strategy actually beginning — the
       // planned phase is never a dead state.
-      if (state.phase !== 'planned') break;
+      if (true) break;
       if (event.strategy === 'direct') {
         return {
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: expected 'planned' to be 'direct' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:210:11
       // The engine reports the planned strategy actually beginning — the
       // planned phase is never a dead state.
       if (state.phase !== 'planned') break;
-      if (event.strategy === 'direct') {
+      if (event.strategy !== 'direct') {
         return {
           state: { ...state, phase: 'direct', authUser: state.initialAuthUser },
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: expected 'planned' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:210:11
       // The engine reports the planned strategy actually beginning — the
       // planned phase is never a dead state.
       if (state.phase !== 'planned') break;
-      if (event.strategy === 'direct') {
+      if (true) {
         return {
           state: { ...state, phase: 'direct', authUser: state.initialAuthUser },
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started drive-auth enters drive-auth
statusReason: expected 'direct' to be 'drive-auth' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:211:16
       // planned phase is never a dead state.
       if (state.phase !== 'planned') break;
       if (event.strategy === 'direct') {
-        return {
-          state: { ...state, phase: 'direct', authUser: state.initialAuthUser },
-          effects: [],
-        };
+        return {};
       }
       if (event.strategy === 'drive-auth') {
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started direct enters direct carrying the initial authuser, no effects
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:216:11
           effects: [],
         };
       }
-      if (event.strategy === 'drive-auth') {
+      if (event.strategy !== 'drive-auth') {
         return { state: { ...state, phase: 'drive-auth' }, effects: [] };
       }
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started drive-auth enters drive-auth
statusReason: expected 'planned' to be 'drive-auth' // Object.is equality
