[Killed] BlockStatement
src/core/acquire/download-url.ts:29:63
 export const DRIVE_DOWNLOAD_ENDPOINT = 'https://drive.usercontent.google.com/download';
 
 /** Build the direct download URL for a Drive file id (pure). */
-export function buildDriveDownloadUrlFrom(id: string): string {
-  return `${DRIVE_DOWNLOAD_ENDPOINT}?id=${encodeURIComponent(id)}&export=download&confirm=t`;
-}
+export function buildDriveDownloadUrlFrom(id: string): string {}
 
 /** Strip a Classroom multi-account `/u/{n}` path prefix. */
killedBy: Button Renderer: renderButton stores file metadata in dataset
statusReason: expected 'undefined' to contain 'drive.usercontent.google.com/download'

[Killed] BlockStatement
src/core/acquire/download-url.ts:34:50
 }
 
 /** Strip a Classroom multi-account `/u/{n}` path prefix. */
-function normalizePath(pathname: string): string {
-  return pathname.replace(/^\/u\/\d+(?=\/)/, '');
-}
+function normalizePath(pathname: string): string {}
 
 /**
killedBy: Button Renderer: renderButton creates a button with correct structure
statusReason: Cannot read properties of undefined (reading 'startsWith')

[Killed] StringLiteral
src/core/acquire/download-url.ts:44:85
  * string literals but not regex literals — never sees a DOM identifier in
  * source; the vocabulary is Drive URL data, not a global reference.
  */
-const DOCS_PATH_RE = new RegExp('^\\/(doc' + 'ument|presentation|drawings|spread' + 'sheets)\\/d\\/([^/]+)');
+const DOCS_PATH_RE = new RegExp('^\\/(doc' + 'ument|presentation|drawings|spread' + "");
 
 /** Extract a Drive file id from a URL's path or query params, if any. */
killedBy: EngineV3 student work API scope does not run API discovery for non-student-work views
statusReason: Invalid regular expression: /^\/(document|presentation|drawings|spread/: Unterminated group

[Killed] BlockStatement
src/core/acquire/download-url.ts:47:67
 const DOCS_PATH_RE = new RegExp('^\\/(doc' + 'ument|presentation|drawings|spread' + 'sheets)\\/d\\/([^/]+)');
 
 /** Extract a Drive file id from a URL's path or query params, if any. */
-export function extractDriveFileId(rawUrl: string): string | null {
-  try {
-    const parsed = new URL(rawUrl);
-    const path = normalizePath(parsed.pathname);
-
-    const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return fileMatch[1];
-
-    const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return docsMatch[2];
-
-    for (const key of ['id', 'resourceId', 'fileId']) {
-      const value = parsed.searchParams.get(key);
-      if (value) return value;
-    }
-  } catch {
-    // Stryker disable next-line BlockStatement: an empty catch is equivalent —
-    // control reaches the identical trailing `return null` below.
-    return null;
-  }
-  return null;
-}
+export function extractDriveFileId(rawUrl: string): string | null {}
 
 /**
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected undefined to be 'ID1' // Object.is equality

[Killed] BlockStatement
src/core/acquire/download-url.ts:48:7
 
 /** Extract a Drive file id from a URL's path or query params, if any. */
 export function extractDriveFileId(rawUrl: string): string | null {
-  try {
-    const parsed = new URL(rawUrl);
-    const path = normalizePath(parsed.pathname);
-
-    const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return fileMatch[1];
-
-    const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return docsMatch[2];
-
-    for (const key of ['id', 'resourceId', 'fileId']) {
-      const value = parsed.searchParams.get(key);
-      if (value) return value;
-    }
-  } catch {
+  try {} catch {
     // Stryker disable next-line BlockStatement: an empty catch is equivalent —
     // control reaches the identical trailing `return null` below.
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID1' // Object.is equality

[Killed] Regex
src/core/acquire/download-url.ts:52:34
     const parsed = new URL(rawUrl);
     const path = normalizePath(parsed.pathname);
 
-    const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
+    const fileMatch = path.match(/^\/file\/d\/([/]+)/);
     if (fileMatch) return fileMatch[1];
 
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID1' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:53:9
     const path = normalizePath(parsed.pathname);
 
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return fileMatch[1];
+    if (true) return fileMatch[1];
 
     const docsMatch = path.match(DOCS_PATH_RE);
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID2' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:53:9
     const path = normalizePath(parsed.pathname);
 
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return fileMatch[1];
+    if (false) return fileMatch[1];
 
     const docsMatch = path.match(DOCS_PATH_RE);
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID1' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:56:9
     if (fileMatch) return fileMatch[1];
 
     const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return docsMatch[2];
+    if (true) return docsMatch[2];
 
     for (const key of ['id', 'resourceId', 'fileId']) {
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID3' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:56:9
     if (fileMatch) return fileMatch[1];
 
     const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return docsMatch[2];
+    if (false) return docsMatch[2];
 
     for (const key of ['id', 'resourceId', 'fileId']) {
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID2' // Object.is equality

[Killed] BlockStatement
src/core/acquire/download-url.ts:58:55
     const docsMatch = path.match(DOCS_PATH_RE);
     if (docsMatch) return docsMatch[2];
 
-    for (const key of ['id', 'resourceId', 'fileId']) {
-      const value = parsed.searchParams.get(key);
-      if (value) return value;
-    }
+    for (const key of ['id', 'resourceId', 'fileId']) {}
   } catch {
     // Stryker disable next-line BlockStatement: an empty catch is equivalent —
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID3' // Object.is equality

[Killed] StringLiteral
src/core/acquire/download-url.ts:58:30
     const docsMatch = path.match(DOCS_PATH_RE);
     if (docsMatch) return docsMatch[2];
 
-    for (const key of ['id', 'resourceId', 'fileId']) {
+    for (const key of ['id', "", 'fileId']) {
       const value = parsed.searchParams.get(key);
       if (value) return value;
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID4' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:60:11
 
     for (const key of ['id', 'resourceId', 'fileId']) {
       const value = parsed.searchParams.get(key);
-      if (value) return value;
+      if (false) return value;
     }
   } catch {
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID3' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:60:11
 
     for (const key of ['id', 'resourceId', 'fileId']) {
       const value = parsed.searchParams.get(key);
-      if (value) return value;
+      if (true) return value;
     }
   } catch {
killedBy: core download-url mapping extractDriveFileId finds ids from every supported shape
statusReason: expected null to be 'ID4' // Object.is equality

[NoCoverage] BlockStatement
src/core/acquire/download-url.ts:62:11
       const value = parsed.searchParams.get(key);
       if (value) return value;
     }
-  } catch {
-    // Stryker disable next-line BlockStatement: an empty catch is equivalent —
-    // control reaches the identical trailing `return null` below.
-    return null;
-  }
+  } catch {}
   return null;
 }

[Killed] BlockStatement
src/core/acquire/download-url.ts:74:67
  * Append the page's authuser to a download URL when not already present.
  * Pure: the authuser value is a parameter, never read from the environment.
  */
-function appendAuth(url: string, authUser: string | null): string {
-  if (!authUser) return url;
-  try {
-    const parsed = new URL(url);
-    if (!parsed.searchParams.has('authuser')) {
-      parsed.searchParams.set('authuser', authUser);
-    }
-    return parsed.toString();
-  } catch {
-    // Stryker disable next-line BlockStatement: an empty catch is equivalent —
-    // control reaches the identical trailing `return url` below.
-    return url;
-  }
-}
+function appendAuth(url: string, authUser: string | null): string {}
 
 /**
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected undefined to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] BooleanLiteral
src/core/acquire/download-url.ts:75:7
  * Pure: the authuser value is a parameter, never read from the environment.
  */
 function appendAuth(url: string, authUser: string | null): string {
-  if (!authUser) return url;
+  if (authUser) return url;
   try {
     const parsed = new URL(url);
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:75:7
  * Pure: the authuser value is a parameter, never read from the environment.
  */
 function appendAuth(url: string, authUser: string | null): string {
-  if (!authUser) return url;
+  if (true) return url;
   try {
     const parsed = new URL(url);
killedBy: core download-url mapping appends the page authuser to the converted URL
statusReason: expected 'https://drive.usercontent.google.com/…' to contain 'authuser=1'

[Killed] BlockStatement
src/core/acquire/download-url.ts:76:7
  */
 function appendAuth(url: string, authUser: string | null): string {
   if (!authUser) return url;
-  try {
-    const parsed = new URL(url);
-    if (!parsed.searchParams.has('authuser')) {
-      parsed.searchParams.set('authuser', authUser);
-    }
-    return parsed.toString();
-  } catch {
+  try {} catch {
     // Stryker disable next-line BlockStatement: an empty catch is equivalent —
     // control reaches the identical trailing `return url` below.
killedBy: core download-url mapping appends the page authuser to the converted URL
statusReason: the given combination of arguments (undefined and string) is invalid for this assertion. You can use an array, a map, an object, a set, a string, or a weakset instead of a string

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:78:9
   if (!authUser) return url;
   try {
     const parsed = new URL(url);
-    if (!parsed.searchParams.has('authuser')) {
+    if (false) {
       parsed.searchParams.set('authuser', authUser);
     }
killedBy: core download-url mapping appends the page authuser to the converted URL
statusReason: expected 'https://drive.usercontent.google.com/…' to contain 'authuser=1'

[Killed] BooleanLiteral
src/core/acquire/download-url.ts:78:9
   if (!authUser) return url;
   try {
     const parsed = new URL(url);
-    if (!parsed.searchParams.has('authuser')) {
+    if (parsed.searchParams.has('authuser')) {
       parsed.searchParams.set('authuser', authUser);
     }
killedBy: core download-url mapping appends the page authuser to the converted URL
statusReason: expected 'https://drive.usercontent.google.com/…' to contain 'authuser=1'

[NoCoverage] BlockStatement
src/core/acquire/download-url.ts:82:11
       parsed.searchParams.set('authuser', authUser);
     }
     return parsed.toString();
-  } catch {
-    // Stryker disable next-line BlockStatement: an empty catch is equivalent —
-    // control reaches the identical trailing `return url` below.
-    return url;
-  }
+  } catch {}
 }
 

[Killed] BooleanLiteral
src/core/acquire/download-url.ts:100:7
   authUser: string | null,
   depth = 0,
 ): string {
-  if (!originalUrl) return originalUrl;
+  if (originalUrl) return originalUrl;
   if (depth > 3) return originalUrl;
 
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:100:7
   authUser: string | null,
   depth = 0,
 ): string {
-  if (!originalUrl) return originalUrl;
+  if (true) return originalUrl;
   if (depth > 3) return originalUrl;
 
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/download-url.ts:101:7
   depth = 0,
 ): string {
   if (!originalUrl) return originalUrl;
-  if (depth > 3) return originalUrl;
+  if (depth <= 3) return originalUrl;
 
   let parsed: URL;
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:101:7
   depth = 0,
 ): string {
   if (!originalUrl) return originalUrl;
-  if (depth > 3) return originalUrl;
+  if (true) return originalUrl;
 
   let parsed: URL;
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] BlockStatement
src/core/acquire/download-url.ts:104:7
   if (depth > 3) return originalUrl;
 
   let parsed: URL;
-  try {
-    parsed = new URL(originalUrl);
-  } catch {
+  try {} catch {
     return originalUrl;
   }
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: Cannot read properties of undefined (reading 'pathname')

[Killed] BlockStatement
src/core/acquire/download-url.ts:106:11
   let parsed: URL;
   try {
     parsed = new URL(originalUrl);
-  } catch {
-    return originalUrl;
-  }
+  } catch {}
   const path = normalizePath(parsed.pathname);
 
killedBy: core download-url mapping returns garbage input as-is
statusReason: Cannot read properties of undefined (reading 'pathname')

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:111:7
   }
   const path = normalizePath(parsed.pathname);
 
-  if (parsed.hostname === 'drive.google.com') {
+  if (true) {
     if (path.startsWith('/auth_warmup')) {
       const cont = parsed.searchParams.get('continue');
killedBy: core download-url mapping — mutation hardening (S12) does not convert file paths on foreign hosts
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://example.com/file/d/X/view' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:111:7
   }
   const path = normalizePath(parsed.pathname);
 
-  if (parsed.hostname === 'drive.google.com') {
+  if (false) {
     if (path.startsWith('/auth_warmup')) {
       const cont = parsed.searchParams.get('continue');
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:112:9
   const path = normalizePath(parsed.pathname);
 
   if (parsed.hostname === 'drive.google.com') {
-    if (path.startsWith('/auth_warmup')) {
+    if (true) {
       const cont = parsed.searchParams.get('continue');
       if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:112:9
   const path = normalizePath(parsed.pathname);
 
   if (parsed.hostname === 'drive.google.com') {
-    if (path.startsWith('/auth_warmup')) {
+    if (false) {
       const cont = parsed.searchParams.get('continue');
       if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
killedBy: core download-url mapping follows auth_warmup continue chains (depth-capped)
statusReason: expected 'https://drive.google.com/auth_warmup?…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:114:11
   if (parsed.hostname === 'drive.google.com') {
     if (path.startsWith('/auth_warmup')) {
       const cont = parsed.searchParams.get('continue');
-      if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
+      if (false) return toDownloadUrlFrom(cont, authUser, depth + 1);
       const id = parsed.searchParams.get('id');
       if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
killedBy: core download-url mapping follows auth_warmup continue chains (depth-capped)
statusReason: expected 'https://drive.google.com/auth_warmup?…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ArithmeticOperator
src/core/acquire/download-url.ts:114:58
   if (parsed.hostname === 'drive.google.com') {
     if (path.startsWith('/auth_warmup')) {
       const cont = parsed.searchParams.get('continue');
-      if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
+      if (cont) return toDownloadUrlFrom(cont, authUser, depth - 1);
       const id = parsed.searchParams.get('id');
       if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
killedBy: core download-url mapping — mutation hardening (S12) caps continue-chain depth: the fourth hop is returned raw, unconverted
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://drive.google.com/file/d/TAIL/…' // Object.is equality

[Killed] StringLiteral
src/core/acquire/download-url.ts:115:42
     if (path.startsWith('/auth_warmup')) {
       const cont = parsed.searchParams.get('continue');
       if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
-      const id = parsed.searchParams.get('id');
+      const id = parsed.searchParams.get("");
       if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
       return appendAuth(originalUrl, authUser);
killedBy: core download-url mapping — mutation hardening (S12) warmup with an id (no continue) converts via the id param (S12)
statusReason: expected 'https://drive.google.com/auth_warmup?…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:116:11
       const cont = parsed.searchParams.get('continue');
       if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
       const id = parsed.searchParams.get('id');
-      if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
+      if (false) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
       return appendAuth(originalUrl, authUser);
     }
killedBy: core download-url mapping — mutation hardening (S12) warmup with an id (no continue) converts via the id param (S12)
statusReason: expected 'https://drive.google.com/auth_warmup?…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:116:11
       const cont = parsed.searchParams.get('continue');
       if (cont) return toDownloadUrlFrom(cont, authUser, depth + 1);
       const id = parsed.searchParams.get('id');
-      if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
+      if (true) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
       return appendAuth(originalUrl, authUser);
     }
killedBy: core download-url mapping — mutation hardening (S12) warmup without continue or id passes through with the authuser appended
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://drive.google.com/auth_warmup?…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:121:9
     }
 
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
+    if (false) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
 
     if (path === '/open' || path === '/uc') {
killedBy: core download-url mapping converts drive /file/d/ URLs to the byte-serving endpoint
statusReason: expected 'https://drive.google.com/file/d/ABC12…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:121:9
     }
 
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
-    if (fileMatch) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
+    if (true) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
 
     if (path === '/open' || path === '/uc') {
killedBy: core download-url mapping converts drive /open and /uc links via their id param
statusReason: Cannot read properties of null (reading '1')

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:123:9
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
     if (fileMatch) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
 
-    if (path === '/open' || path === '/uc') {
+    if (false) {
       const id = parsed.searchParams.get('id');
       if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
killedBy: core download-url mapping converts drive /open and /uc links via their id param
statusReason: expected 'https://drive.google.com/open?id=XYZ' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:123:9
     const fileMatch = path.match(/^\/file\/d\/([^/]+)/);
     if (fileMatch) return appendAuth(buildDriveDownloadUrlFrom(fileMatch[1]), authUser);
 
-    if (path === '/open' || path === '/uc') {
+    if (false || path === '/uc') {
       const id = parsed.searchParams.get('id');
       if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
killedBy: core download-url mapping converts drive /open and /uc links via their id param
statusReason: expected 'https://drive.google.com/open?id=XYZ' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:130:7
     }
   }
 
-  if (parsed.hostname === 'classroom.google.com' && path.startsWith('/drive')) {
+  if (true) {
     const id =
       parsed.searchParams.get('id') ||
killedBy: core download-url mapping — mutation hardening (S12) foreign URLs carrying an id param are never classroom-converted (S12)
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://example.com/?id=Q9' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:130:7
     }
   }
 
-  if (parsed.hostname === 'classroom.google.com' && path.startsWith('/drive')) {
+  if (true && path.startsWith('/drive')) {
     const id =
       parsed.searchParams.get('id') ||
killedBy: core download-url mapping — mutation hardening (S12) foreign URLs carrying an id param are never classroom-converted (S12)
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://docs.google.com/drive/x?id=Q9' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:132:7
 
   if (parsed.hostname === 'classroom.google.com' && path.startsWith('/drive')) {
     const id =
-      parsed.searchParams.get('id') ||
-      parsed.searchParams.get('resourceId') ||
-      parsed.searchParams.get('fileId');
+      true;
     if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
killedBy: core download-url mapping converts classroom drive-proxy links via id/resourceId/fileId
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] LogicalOperator
src/core/acquire/download-url.ts:132:7
 
   if (parsed.hostname === 'classroom.google.com' && path.startsWith('/drive')) {
     const id =
-      parsed.searchParams.get('id') ||
-      parsed.searchParams.get('resourceId') ||
-      parsed.searchParams.get('fileId');
+      (parsed.searchParams.get('id') || parsed.searchParams.get('resourceId')) && parsed.searchParams.get('fileId');
     if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
killedBy: core download-url mapping converts classroom drive-proxy links via id/resourceId/fileId
statusReason: expected 'https://classroom.google.com/drive/ab…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] StringLiteral
src/core/acquire/download-url.ts:134:31
     const id =
       parsed.searchParams.get('id') ||
       parsed.searchParams.get('resourceId') ||
-      parsed.searchParams.get('fileId');
+      parsed.searchParams.get("");
     if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
killedBy: core download-url mapping — mutation hardening (S12) classroom drive-proxy id params win in id → resourceId → fileId order
statusReason: expected 'https://classroom.google.com/drive/p?…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:135:9
       parsed.searchParams.get('id') ||
       parsed.searchParams.get('resourceId') ||
       parsed.searchParams.get('fileId');
-    if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
+    if (false) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
 
killedBy: core download-url mapping converts classroom drive-proxy links via id/resourceId/fileId
statusReason: expected 'https://classroom.google.com/drive/ab…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Survived] ConditionalExpression
src/core/acquire/download-url.ts:135:9
       parsed.searchParams.get('id') ||
       parsed.searchParams.get('resourceId') ||
       parsed.searchParams.get('fileId');
-    if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
+    if (true) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
 

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:138:7
     if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
 
-  if (parsed.hostname === 'docs.google.com') {
+  if (true) {
     const docsMatch = path.match(DOCS_PATH_RE);
     if (docsMatch) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
killedBy: core download-url mapping — mutation hardening (S12) does not convert file paths on foreign hosts
statusReason: expected 'https://drive.usercontent.google.com/…' to be 'https://evil.example.com/document/d/Y…' // Object.is equality

[Killed] BlockStatement
src/core/acquire/download-url.ts:138:46
     if (id) return appendAuth(buildDriveDownloadUrlFrom(id), authUser);
   }
 
-  if (parsed.hostname === 'docs.google.com') {
-    const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
-  }
+  if (parsed.hostname === 'docs.google.com') {}
 
   return appendAuth(originalUrl, authUser);
killedBy: core download-url mapping converts docs/sheets/slides/drawings viewer URLs (z57 S2 parity with V1)
statusReason: expected 'https://docs.google.com/document/d/DO…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:140:9
 
   if (parsed.hostname === 'docs.google.com') {
     const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
+    if (false) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
   }
 
killedBy: core download-url mapping converts docs/sheets/slides/drawings viewer URLs (z57 S2 parity with V1)
statusReason: expected 'https://docs.google.com/document/d/DO…' to be 'https://drive.usercontent.google.com/…' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/download-url.ts:140:9
 
   if (parsed.hostname === 'docs.google.com') {
     const docsMatch = path.match(DOCS_PATH_RE);
-    if (docsMatch) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
+    if (true) return appendAuth(buildDriveDownloadUrlFrom(docsMatch[2]), authUser);
   }
 
killedBy: core download-url mapping passes unrecognized URLs through unchanged (authuser appended)
statusReason: Cannot read properties of null (reading '2')
