[Killed] Regex
src/core/detect/matching.ts:46:3
  * matching, because "whole token" is meaningless there.
  */
 const UNSPACED_SCRIPT_CHARS: RegExp =
-  /[\u0E00-\u0E7F\u0E80-\u0EFF\u1000-\u109F\u1780-\u17FF\u1100-\u11FF\u3130-\u318F\u3040-\u30FF\u3400-\u4DBF\u4E00-\u9FFF\uAC00-\uD7AF\uF900-\uFAFF\u{20000}-\u{2FA1F}]/u;
+  /[^\u0E00-\u0E7F\u0E80-\u0EFF\u1000-\u109F\u1780-\u17FF\u1100-\u11FF\u3130-\u318F\u3040-\u30FF\u3400-\u4DBF\u4E00-\u9FFF\uAC00-\uD7AF\uF900-\uFAFF\u{20000}-\u{2FA1F}]/u;
 
 /** Whitespace, punctuation and symbol boundaries — the D2 token grammar. */
killedBy: matchesKeyword() — whole-token semantics (D6) misses when the keyword only appears inside a longer word (D6)
statusReason: expected true to be false // Object.is equality

[Killed] Regex
src/core/detect/matching.ts:49:34
   /[\u0E00-\u0E7F\u0E80-\u0EFF\u1000-\u109F\u1780-\u17FF\u1100-\u11FF\u3130-\u318F\u3040-\u30FF\u3400-\u4DBF\u4E00-\u9FFF\uAC00-\uD7AF\uF900-\uFAFF\u{20000}-\u{2FA1F}]/u;
 
 /** Whitespace, punctuation and symbol boundaries — the D2 token grammar. */
-const TOKEN_BOUNDARIES: RegExp = /[\s\p{P}\p{S}]+/u;
+const TOKEN_BOUNDARIES: RegExp = /[\S\p{P}\p{S}]+/u;
 
 /** True if the string carries at least one character from an unspaced script. */
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: expected false to be true // Object.is equality

[Survived] Regex
src/core/detect/matching.ts:49:34
   /[\u0E00-\u0E7F\u0E80-\u0EFF\u1000-\u109F\u1780-\u17FF\u1100-\u11FF\u3130-\u318F\u3040-\u30FF\u3400-\u4DBF\u4E00-\u9FFF\uAC00-\uD7AF\uF900-\uFAFF\u{20000}-\u{2FA1F}]/u;
 
 /** Whitespace, punctuation and symbol boundaries — the D2 token grammar. */
-const TOKEN_BOUNDARIES: RegExp = /[\s\p{P}\p{S}]+/u;
+const TOKEN_BOUNDARIES: RegExp = /[\s\p{P}\p{S}]/u;
 
 /** True if the string carries at least one character from an unspaced script. */

[Killed] BlockStatement
src/core/detect/matching.ts:52:62
 const TOKEN_BOUNDARIES: RegExp = /[\s\p{P}\p{S}]+/u;
 
 /** True if the string carries at least one character from an unspaced script. */
-export function hasUnspacedScriptChar(text: string): boolean {
-  return !!text && UNSPACED_SCRIPT_CHARS.test(text);
-}
+export function hasUnspacedScriptChar(text: string): boolean {}
 
 /**
killedBy: matchesKeyword() — unspaced scripts keep substring containment keeps the Japanese keyword matching inside longer strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:53:10
 
 /** True if the string carries at least one character from an unspaced script. */
 export function hasUnspacedScriptChar(text: string): boolean {
-  return !!text && UNSPACED_SCRIPT_CHARS.test(text);
+  return true;
 }
 
killedBy: matchesKeyword() — whole-token semantics (D6) misses when the keyword only appears inside a longer word (D6)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/detect/matching.ts:53:10
 
 /** True if the string carries at least one character from an unspaced script. */
 export function hasUnspacedScriptChar(text: string): boolean {
-  return !!text && UNSPACED_SCRIPT_CHARS.test(text);
+  return !text && UNSPACED_SCRIPT_CHARS.test(text);
 }
 
killedBy: matchesKeyword() — unspaced scripts keep substring containment keeps the Japanese keyword matching inside longer strings
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/detect/matching.ts:62:68
  * Exported for callers that share one token list across many keyword checks
  * (the keyword loops normalize their text once and reuse it).
  */
-export function comparisonTokens(normalizedText: string): string[] {
-  if (!normalizedText) return [];
-  return normalizedText.split(TOKEN_BOUNDARIES).filter(Boolean);
-}
+export function comparisonTokens(normalizedText: string): string[] {}
 
 /**
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] BooleanLiteral
src/core/detect/matching.ts:63:7
  * (the keyword loops normalize their text once and reuse it).
  */
 export function comparisonTokens(normalizedText: string): string[] {
-  if (!normalizedText) return [];
+  if (normalizedText) return [];
   return normalizedText.split(TOKEN_BOUNDARIES).filter(Boolean);
 }
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:63:7
  * (the keyword loops normalize their text once and reuse it).
  */
 export function comparisonTokens(normalizedText: string): string[] {
-  if (!normalizedText) return [];
+  if (true) return [];
   return normalizedText.split(TOKEN_BOUNDARIES).filter(Boolean);
 }
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: expected false to be true // Object.is equality

[Survived] MethodExpression
src/core/detect/matching.ts:64:10
  */
 export function comparisonTokens(normalizedText: string): string[] {
   if (!normalizedText) return [];
-  return normalizedText.split(TOKEN_BOUNDARIES).filter(Boolean);
+  return normalizedText.split(TOKEN_BOUNDARIES);
 }
 

[Killed] BooleanLiteral
src/core/detect/matching.ts:82:26
   normalizedText: string,
   normalizedKeyword: string,
 ): boolean {
-  if (!normalizedText || !normalizedKeyword) return false;
+  if (!normalizedText || normalizedKeyword) return false;
 
   const keywordTokens = comparisonTokens(normalizedKeyword);
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:82:7
   normalizedText: string,
   normalizedKeyword: string,
 ): boolean {
-  if (!normalizedText || !normalizedKeyword) return false;
+  if (true) return false;
 
   const keywordTokens = comparisonTokens(normalizedKeyword);
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:86:7
 
   const keywordTokens = comparisonTokens(normalizedKeyword);
 
-  if (keywordTokens.length > 1) {
+  if (false) {
     // Phrase keyword: the keyword's tokens must appear as a consecutive run
     // of whole tokens in the text.
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/detect/matching.ts:86:7
 
   const keywordTokens = comparisonTokens(normalizedKeyword);
 
-  if (keywordTokens.length > 1) {
+  if (keywordTokens.length <= 1) {
     // Phrase keyword: the keyword's tokens must appear as a consecutive run
     // of whole tokens in the text.
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:94:25
     // loop cap — overrunning it compares undefined tokens, which never equal a
     // keyword token, so every mutant here is behaviorally identical.
     const lastStart = textTokens.length - keywordTokens.length;
-    for (let start = 0; start <= lastStart; start++) {
+    for (let start = 0; false; start++) {
       let matched = true;
       for (let offset = 0; offset < keywordTokens.length; offset++) {
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/detect/matching.ts:94:54
     // loop cap — overrunning it compares undefined tokens, which never equal a
     // keyword token, so every mutant here is behaviorally identical.
     const lastStart = textTokens.length - keywordTokens.length;
-    for (let start = 0; start <= lastStart; start++) {
-      let matched = true;
-      for (let offset = 0; offset < keywordTokens.length; offset++) {
-        if (textTokens[start + offset] !== keywordTokens[offset]) {
-          matched = false;
-          break;
-        }
-      }
-      if (matched) return true;
-    }
+    for (let start = 0; start <= lastStart; start++) {}
     return false;
   }
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] BooleanLiteral
src/core/detect/matching.ts:95:21
     // keyword token, so every mutant here is behaviorally identical.
     const lastStart = textTokens.length - keywordTokens.length;
     for (let start = 0; start <= lastStart; start++) {
-      let matched = true;
+      let matched = false;
       for (let offset = 0; offset < keywordTokens.length; offset++) {
         if (textTokens[start + offset] !== keywordTokens[offset]) {
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] EqualityOperator
src/core/detect/matching.ts:96:28
     const lastStart = textTokens.length - keywordTokens.length;
     for (let start = 0; start <= lastStart; start++) {
       let matched = true;
-      for (let offset = 0; offset < keywordTokens.length; offset++) {
+      for (let offset = 0; offset <= keywordTokens.length; offset++) {
         if (textTokens[start + offset] !== keywordTokens[offset]) {
           matched = false;
killedBy: flag scoring characterization produces output identical to the committed baseline
statusReason: expected { …(9) } to deeply equal { …(9) }

[Killed] ConditionalExpression
src/core/detect/matching.ts:96:28
     const lastStart = textTokens.length - keywordTokens.length;
     for (let start = 0; start <= lastStart; start++) {
       let matched = true;
-      for (let offset = 0; offset < keywordTokens.length; offset++) {
+      for (let offset = 0; false; offset++) {
         if (textTokens[start + offset] !== keywordTokens[offset]) {
           matched = false;
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BlockStatement
src/core/detect/matching.ts:97:67
     for (let start = 0; start <= lastStart; start++) {
       let matched = true;
       for (let offset = 0; offset < keywordTokens.length; offset++) {
-        if (textTokens[start + offset] !== keywordTokens[offset]) {
-          matched = false;
-          break;
-        }
+        if (textTokens[start + offset] !== keywordTokens[offset]) {}
       }
       if (matched) return true;
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] EqualityOperator
src/core/detect/matching.ts:97:13
     for (let start = 0; start <= lastStart; start++) {
       let matched = true;
       for (let offset = 0; offset < keywordTokens.length; offset++) {
-        if (textTokens[start + offset] !== keywordTokens[offset]) {
+        if (textTokens[start + offset] === keywordTokens[offset]) {
           matched = false;
           break;
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] BooleanLiteral
src/core/detect/matching.ts:98:21
       let matched = true;
       for (let offset = 0; offset < keywordTokens.length; offset++) {
         if (textTokens[start + offset] !== keywordTokens[offset]) {
-          matched = false;
+          matched = true;
           break;
         }
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:102:11
           break;
         }
       }
-      if (matched) return true;
+      if (true) return true;
     }
     return false;
killedBy: detectComments() - DOM Integration RTL Languages [ar-1] Arabic: Single class comment with word-number "واحد"
statusReason: expected +0 to be 1 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:102:11
           break;
         }
       }
-      if (matched) return true;
+      if (false) return true;
     }
     return false;
killedBy: detectEdited() - DOM Integration [edit-ar-1] Arabic: Edited marker (تم تعديله)
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/detect/matching.ts:109:24
 
   // Single-word keyword. Decide the semantics by script, never by language.
   const keywordUnspaced = hasUnspacedScriptChar(normalizedKeyword);
-  const textUnspaced = !/\s/.test(normalizedText) && hasUnspacedScriptChar(normalizedText);
+  const textUnspaced = !/\s/.test(normalizedText) || hasUnspacedScriptChar(normalizedText);
   if (keywordUnspaced || textUnspaced) {
     // Unspaced script: whole tokens do not exist, keep substring containment
killedBy: isExcludedText (fast path) does NOT exclude "reediting" for the editing rule (D14)
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/detect/matching.ts:109:24
 
   // Single-word keyword. Decide the semantics by script, never by language.
   const keywordUnspaced = hasUnspacedScriptChar(normalizedKeyword);
-  const textUnspaced = !/\s/.test(normalizedText) && hasUnspacedScriptChar(normalizedText);
+  const textUnspaced = /\s/.test(normalizedText) && hasUnspacedScriptChar(normalizedText);
   if (keywordUnspaced || textUnspaced) {
     // Unspaced script: whole tokens do not exist, keep substring containment
killedBy: matchesKeyword() — unspaced scripts keep substring containment unspaced-text-with-spaced-keyword edge: falls back to substring
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/detect/matching.ts:110:40
   // Single-word keyword. Decide the semantics by script, never by language.
   const keywordUnspaced = hasUnspacedScriptChar(normalizedKeyword);
   const textUnspaced = !/\s/.test(normalizedText) && hasUnspacedScriptChar(normalizedText);
-  if (keywordUnspaced || textUnspaced) {
-    // Unspaced script: whole tokens do not exist, keep substring containment
-    // so 'コメント' keeps matching inside '4件のコメント'.
-    return normalizedText.includes(normalizedKeyword);
-  }
+  if (keywordUnspaced || textUnspaced) {}
 
   // Space-delimited script: whole-token equality only. The tables carry the
killedBy: matchesKeyword() — unspaced scripts keep substring containment keeps the Japanese keyword matching inside longer strings
statusReason: expected false to be true // Object.is equality

[Killed] ConditionalExpression
src/core/detect/matching.ts:110:7
   // Single-word keyword. Decide the semantics by script, never by language.
   const keywordUnspaced = hasUnspacedScriptChar(normalizedKeyword);
   const textUnspaced = !/\s/.test(normalizedText) && hasUnspacedScriptChar(normalizedText);
-  if (keywordUnspaced || textUnspaced) {
+  if (false) {
     // Unspaced script: whole tokens do not exist, keep substring containment
     // so 'コメント' keeps matching inside '4件のコメント'.
killedBy: matchesKeyword() — unspaced scripts keep substring containment keeps the Japanese keyword matching inside longer strings
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/detect/matching.ts:129:72
  * normalizeForComparison output may use matchesNormalizedKeyword() to skip
  * the repeated cleaning.
  */
-export function matchesKeyword(text: string, keyword: string): boolean {
-  return matchesNormalizedKeyword(
-    normalizeForComparison(text),
-    normalizeForComparison(keyword),
-  );
-}
+export function matchesKeyword(text: string, keyword: string): boolean {}
 
killedBy: matchesKeyword() — whole-token semantics (D6) matches a single-word keyword as a whole token
statusReason: expected undefined to be true // Object.is equality
