[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:216:11
           effects: [],
         };
       }
-      if (event.strategy === 'drive-auth') {
+      if (false) {
         return { state: { ...state, phase: 'drive-auth' }, effects: [] };
       }
killedBy: PLANNED phase — strategy-started and inert edges (S12) strategy-started drive-auth enters drive-auth
statusReason: expected 'planned' to be 'drive-auth' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:222:30
       break;
     }
 
-    case 'download-started': {
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        return { state: { ...state, downloadId: event.downloadId }, effects: [] };
-      }
-      return { state, effects: [] };
-    }
+    case 'download-started': {}
 
     case 'start-failed': {
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: expected undefined to be 11 // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:222:5
       break;
     }
 
-    case 'download-started': {
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        return { state: { ...state, downloadId: event.downloadId }, effects: [] };
-      }
-      return { state, effects: [] };
-    }
+    case 'download-started':
 
     case 'start-failed': {
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: expected undefined to be 11 // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:223:11
     }
 
     case 'download-started': {
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (false) {
         return { state: { ...state, downloadId: event.downloadId }, effects: [] };
       }
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: expected undefined to be 11 // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:223:11
     }
 
     case 'download-started': {
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (false || state.phase === 'drive-auth') {
         return { state: { ...state, downloadId: event.downloadId }, effects: [] };
       }
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: expected undefined to be 11 // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:224:25
 
     case 'download-started': {
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        return { state: { ...state, downloadId: event.downloadId }, effects: [] };
+        return { state: {}, effects: [] };
       }
       return { state, effects: [] };
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: expected undefined to be 'direct' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:224:16
 
     case 'download-started': {
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        return { state: { ...state, downloadId: event.downloadId }, effects: [] };
+        return {};
       }
       return { state, effects: [] };
killedBy: PLANNED → DIRECT phase a started download records the id and stays direct
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ArrayDeclaration
src/core/acquire/state-machine.ts:226:32
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
         return { state: { ...state, downloadId: event.downloadId }, effects: [] };
       }
-      return { state, effects: [] };
+      return { state, effects: ["Stryker was here"] };
     }
 
killedBy: PLANNED phase — strategy-started and inert edges (S12) download-started in planned is inert
statusReason: expected [ 'Stryker was here' ] to deeply equal []

[Killed] BlockStatement
src/core/acquire/state-machine.ts:229:26
       return { state, effects: [] };
     }
 
-    case 'start-failed': {
-      if (state.phase !== 'direct') break;
-      // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
-      // can transiently refuse a start — then settle with honest guidance.
-      if (!state.startRetried) {
-        return {
-          state: { ...state, startRetried: true },
-          effects: [
-            { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
-            { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-          ],
-        };
-      }
-      const outcome: AcquireOutcome = { status: 'browser-fail', detail: 'browser blocked download' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'start-failed': {}
 
     case 'html-interstitial-seen': {
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected 'drive-auth' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:229:5
       return { state, effects: [] };
     }
 
-    case 'start-failed': {
-      if (state.phase !== 'direct') break;
-      // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
-      // can transiently refuse a start — then settle with honest guidance.
-      if (!state.startRetried) {
-        return {
-          state: { ...state, startRetried: true },
-          effects: [
-            { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
-            { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-          ],
-        };
-      }
-      const outcome: AcquireOutcome = { status: 'browser-fail', detail: 'browser blocked download' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'start-failed':
 
     case 'html-interstitial-seen': {
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected 'drive-auth' to be 'direct' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:230:11
     }
 
     case 'start-failed': {
-      if (state.phase !== 'direct') break;
+      if (false) break;
       // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
       // can transiently refuse a start — then settle with honest guidance.
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a start failure in a non-direct phase is inert
statusReason: expected { phase: 'drive-auth', …(6) } to be { phase: 'drive-auth', …(5) } // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:230:11
     }
 
     case 'start-failed': {
-      if (state.phase !== 'direct') break;
+      if (state.phase === 'direct') break;
       // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
       // can transiently refuse a start — then settle with honest guidance.
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected [] to deep equally contain { type: 'begin-strategy', …(2) }

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:233:11
       if (state.phase !== 'direct') break;
       // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
       // can transiently refuse a start — then settle with honest guidance.
-      if (!state.startRetried) {
+      if (true) {
         return {
           state: { ...state, startRetried: true },
killedBy: PLANNED → DIRECT phase a start failure on a non-drive file retries once, then settles browser-fail
statusReason: expected 'direct' to be 'settled' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:233:32
       if (state.phase !== 'direct') break;
       // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
       // can transiently refuse a start — then settle with honest guidance.
-      if (!state.startRetried) {
-        return {
-          state: { ...state, startRetried: true },
-          effects: [
-            { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
-            { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-          ],
-        };
-      }
+      if (!state.startRetried) {}
       const outcome: AcquireOutcome = { status: 'browser-fail', detail: 'browser blocked download' };
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected 'settled' to be 'direct' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:234:16
       // Zero-tab contract: no bypass-tab fallback. Retry once — the browser
       // can transiently refuse a start — then settle with honest guidance.
       if (!state.startRetried) {
-        return {
-          state: { ...state, startRetried: true },
-          effects: [
-            { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
-            { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-          ],
-        };
+        return {};
       }
       const outcome: AcquireOutcome = { status: 'browser-fail', detail: 'browser blocked download' };
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] BooleanLiteral
src/core/acquire/state-machine.ts:235:44
       // can transiently refuse a start — then settle with honest guidance.
       if (!state.startRetried) {
         return {
-          state: { ...state, startRetried: true },
+          state: { ...state, startRetried: false },
           effects: [
             { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
killedBy: PLANNED → DIRECT phase a start failure on a non-drive file retries once, then settles browser-fail
statusReason: expected false to be true // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:235:18
       // can transiently refuse a start — then settle with honest guidance.
       if (!state.startRetried) {
         return {
-          state: { ...state, startRetried: true },
+          state: {},
           effects: [
             { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected undefined to be 'direct' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:237:13
         return {
           state: { ...state, startRetried: true },
           effects: [
-            { type: 'begin-strategy', strategy: 'direct', authUser: state.authUser },
+            {},
             { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
           ],
killedBy: PLANNED → DIRECT phase a start failure on a drive file retries in place once (zero-tab)
statusReason: expected [ {}, { type: 'set-deadline', …(1) } ] to deep equally contain { type: 'begin-strategy', …(2) }

[Killed] BlockStatement
src/core/acquire/state-machine.ts:246:36
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'html-interstitial-seen': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      if (state.phase === 'direct') {
-        if (state.isDrive) return rotateAuthUser(state);
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'html-interstitial-seen': {}
 
     case 'forbidden-confirmed': {
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a late html interstitial on a non-drive direct attempt fails honestly
statusReason: expected 'forbidden' to be 'html-interstitial' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:246:5
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'html-interstitial-seen': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      if (state.phase === 'direct') {
-        if (state.isDrive) return rotateAuthUser(state);
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'html-interstitial-seen':
 
     case 'forbidden-confirmed': {
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a late html interstitial on a non-drive direct attempt fails honestly
statusReason: expected 'forbidden' to be 'html-interstitial' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:247:11
     }
 
     case 'html-interstitial-seen': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
+      if (state.phase !== 'drive-auth') return rotateAuthUser(state);
       if (state.phase === 'direct') {
         if (state.isDrive) return rotateAuthUser(state);
killedBy: PLANNED phase — strategy-started and inert edges (S12) html-interstitial-seen in planned is inert
statusReason: expected { phase: 'drive-auth', …(7) } to be { phase: 'planned', …(6) } // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:247:11
     }
 
     case 'html-interstitial-seen': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
+      if (true) return rotateAuthUser(state);
       if (state.phase === 'direct') {
         if (state.isDrive) return rotateAuthUser(state);
killedBy: PLANNED phase — strategy-started and inert edges (S12) html-interstitial-seen in planned is inert
statusReason: expected { phase: 'drive-auth', …(7) } to be { phase: 'planned', …(6) } // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:248:11
 
     case 'html-interstitial-seen': {
       if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      if (state.phase === 'direct') {
+      if (false) {
         if (state.isDrive) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'direct' to be 'drive-auth' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:248:11
 
     case 'html-interstitial-seen': {
       if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      if (state.phase === 'direct') {
+      if (true) {
         if (state.isDrive) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
killedBy: PLANNED phase — strategy-started and inert edges (S12) html-interstitial-seen in planned is inert
statusReason: expected { phase: 'drive-auth', …(7) } to be { phase: 'planned', …(6) } // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:249:13
     case 'html-interstitial-seen': {
       if (state.phase === 'drive-auth') return rotateAuthUser(state);
       if (state.phase === 'direct') {
-        if (state.isDrive) return rotateAuthUser(state);
+        if (true) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a late html interstitial on a non-drive direct attempt fails honestly
statusReason: expected 'drive-auth' to be 'settled' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:249:13
     case 'html-interstitial-seen': {
       if (state.phase === 'drive-auth') return rotateAuthUser(state);
       if (state.phase === 'direct') {
-        if (state.isDrive) return rotateAuthUser(state);
+        if (false) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: PLANNED → DIRECT phase an html interstitial on a drive file rotates into drive-auth
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:250:51
       if (state.phase === 'drive-auth') return rotateAuthUser(state);
       if (state.phase === 'direct') {
         if (state.isDrive) return rotateAuthUser(state);
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'html-interstitial' };
+        const outcome: AcquireOutcome = { status: "", detail: 'html-interstitial' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
       }
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a late html interstitial on a non-drive direct attempt fails honestly
statusReason: expected '' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:256:33
       break;
     }
 
-    case 'forbidden-confirmed': {
-      // Zero-tab: the account sweep IS the fallback — no bypass tab. Drive
-      // rotates to the next signed-in account; non-Drive has no account axis
-      // and fails honestly.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (state.isDrive) return rotateAuthUser(state);
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'forbidden-confirmed': {}
 
     case 'transient-failed': {
killedBy: PLANNED → DIRECT phase a confirmed 403 rotates to the next signed-in account (zero-tab)
statusReason: expected 'direct' to be 'drive-auth' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:256:5
       break;
     }
 
-    case 'forbidden-confirmed': {
-      // Zero-tab: the account sweep IS the fallback — no bypass tab. Drive
-      // rotates to the next signed-in account; non-Drive has no account axis
-      // and fails honestly.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (state.isDrive) return rotateAuthUser(state);
-        const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'forbidden-confirmed':
 
     case 'transient-failed': {
killedBy: PLANNED → DIRECT phase a confirmed 403 rotates to the next signed-in account (zero-tab)
statusReason: expected 'direct' to be 'drive-auth' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:260:11
       // Zero-tab: the account sweep IS the fallback — no bypass tab. Drive
       // rotates to the next signed-in account; non-Drive has no account axis
       // and fails honestly.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (true) {
         if (state.isDrive) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
killedBy: PLANNED phase — strategy-started and inert edges (S12) forbidden-confirmed in planned is inert
statusReason: expected { phase: 'drive-auth', …(7) } to be { phase: 'planned', …(6) } // Object.is equality

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:260:11
       // Zero-tab: the account sweep IS the fallback — no bypass tab. Drive
       // rotates to the next signed-in account; non-Drive has no account axis
       // and fails honestly.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (state.phase === 'direct' && state.phase === 'drive-auth') {
         if (state.isDrive) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
killedBy: PLANNED → DIRECT phase a confirmed 403 rotates to the next signed-in account (zero-tab)
statusReason: expected 'direct' to be 'drive-auth' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:261:13
       // rotates to the next signed-in account; non-Drive has no account axis
       // and fails honestly.
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (state.isDrive) return rotateAuthUser(state);
+        if (true) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a confirmed 403 on a non-drive direct attempt fails honestly
statusReason: expected 'drive-auth' to be 'settled' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:261:13
       // rotates to the next signed-in account; non-Drive has no account axis
       // and fails honestly.
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (state.isDrive) return rotateAuthUser(state);
+        if (false) return rotateAuthUser(state);
         const outcome: AcquireOutcome = { status: 'failed', detail: 'forbidden' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: PLANNED → DIRECT phase a confirmed 403 rotates to the next signed-in account (zero-tab)
statusReason: expected 'settled' to be 'drive-auth' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:268:5
       break;
     }
 
-    case 'transient-failed': {
-      // NETWORK_FAILED / SERVER_FAILED class: one in-place retry with a fresh
-      // deadline, then settle — transient failures are worth one more try,
-      // never an unbounded loop.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (!state.transientRetried) {
-          return {
-            state: { ...state, transientRetried: true },
-            effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
-              { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-            ],
-          };
-        }
-        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'transient-failed':
 
     case 'auth-attempt-failed': {
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected undefined to be true // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:268:30
       break;
     }
 
-    case 'transient-failed': {
-      // NETWORK_FAILED / SERVER_FAILED class: one in-place retry with a fresh
-      // deadline, then settle — transient failures are worth one more try,
-      // never an unbounded loop.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (!state.transientRetried) {
-          return {
-            state: { ...state, transientRetried: true },
-            effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
-              { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-            ],
-          };
-        }
-        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-      }
-      break;
-    }
+    case 'transient-failed': {}
 
     case 'auth-attempt-failed': {
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected undefined to be true // Object.is equality

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:272:11
       // NETWORK_FAILED / SERVER_FAILED class: one in-place retry with a fresh
       // deadline, then settle — transient failures are worth one more try,
       // never an unbounded loop.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (state.phase === 'direct' && state.phase === 'drive-auth') {
         if (!state.transientRetried) {
           return {
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected undefined to be true // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:272:11
       // NETWORK_FAILED / SERVER_FAILED class: one in-place retry with a fresh
       // deadline, then settle — transient failures are worth one more try,
       // never an unbounded loop.
-      if (state.phase === 'direct' || state.phase === 'drive-auth') {
+      if (state.phase !== 'direct' || state.phase === 'drive-auth') {
         if (!state.transientRetried) {
           return {
killedBy: PLANNED phase — strategy-started and inert edges (S12) transient-failed in planned is inert
statusReason: expected { phase: 'planned', …(7) } to be { phase: 'planned', …(6) } // Object.is equality

[Killed] BooleanLiteral
src/core/acquire/state-machine.ts:273:13
       // deadline, then settle — transient failures are worth one more try,
       // never an unbounded loop.
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (!state.transientRetried) {
+        if (state.transientRetried) {
           return {
             state: { ...state, transientRetried: true },
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected 'settled' to be 'direct' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:273:38
       // deadline, then settle — transient failures are worth one more try,
       // never an unbounded loop.
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
-        if (!state.transientRetried) {
-          return {
-            state: { ...state, transientRetried: true },
-            effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
-              { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-            ],
-          };
-        }
+        if (!state.transientRetried) {}
         const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected 'settled' to be 'direct' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:274:18
       // never an unbounded loop.
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
         if (!state.transientRetried) {
-          return {
-            state: { ...state, transientRetried: true },
-            effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
-              { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
-            ],
-          };
+          return {};
         }
         const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] BooleanLiteral
src/core/acquire/state-machine.ts:275:50
       if (state.phase === 'direct' || state.phase === 'drive-auth') {
         if (!state.transientRetried) {
           return {
-            state: { ...state, transientRetried: true },
+            state: { ...state, transientRetried: false },
             effects: [
               { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected false to be true // Object.is equality
