[Killed] Regex
src/core/detect/numerals.ts:25:23
 const DIGIT = /\p{Nd}/u;
 
 /** Invisible BiDi controls that Classroom sprinkles around RTL numerals. */
-const BIDI_CONTROLS = /[​-‏‪-‮⁦-⁩]/g;
+const BIDI_CONTROLS = /[^​-‏‪-‮⁦-⁩]/g;
 
 /** True if the character is a decimal digit in any script. */
killedBy: tier B runner produces one observation per post
statusReason: expected null to be 5 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:28:48
 const BIDI_CONTROLS = /[​-‏‪-‮⁦-⁩]/g;
 
 /** True if the character is a decimal digit in any script. */
-export function isDigit(char: string): boolean {
-  return char.length > 0 && DIGIT.test(char);
-}
+export function isDigit(char: string): boolean {}
 
 /** True if the text contains a decimal digit in any script. */
killedBy: scoreComments detects L0 DOM truth via .qCWAqb .huI6Cb
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:29:10
 
 /** True if the character is a decimal digit in any script. */
 export function isDigit(char: string): boolean {
-  return char.length > 0 && DIGIT.test(char);
+  return char.length <= 0 && DIGIT.test(char);
 }
 
killedBy: digitValue reads ASCII digits
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:29:10
 
 /** True if the character is a decimal digit in any script. */
 export function isDigit(char: string): boolean {
-  return char.length > 0 && DIGIT.test(char);
+  return true;
 }
 
killedBy: digitValue rejects non-digits
statusReason: expected +0 to be -1 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:33:49
 }
 
 /** True if the text contains a decimal digit in any script. */
-export function hasDigit(text: string): boolean {
-  return !!text && DIGIT.test(text);
-}
+export function hasDigit(text: string): boolean {}
 
 /**
killedBy: core/detect/numerals recognises decimal digits in any script
statusReason: expected undefined to be false // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:34:10
 
 /** True if the text contains a decimal digit in any script. */
 export function hasDigit(text: string): boolean {
-  return !!text && DIGIT.test(text);
+  return true;
 }
 
killedBy: core/detect/numerals recognises decimal digits in any script
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/detect/numerals.ts:34:11
 
 /** True if the text contains a decimal digit in any script. */
 export function hasDigit(text: string): boolean {
-  return !!text && DIGIT.test(text);
+  return !text && DIGIT.test(text);
 }
 
killedBy: core/detect/numerals recognises decimal digits in any script
statusReason: expected false to be true // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:46:50
  * the start of its own run. That works for every `Nd` script — present and
  * future — with no table to fall out of date.
  */
-export function digitValue(char: string): number {
-  if (!isDigit(char)) return -1;
-  const cp = char.codePointAt(0);
-  // The guard above guarantees a digit, so cp is always defined here.
-  // Stryker disable next-line ConditionalExpression,UnaryOperator
-  if (cp === undefined) return -1;
-
-  for (let value = 0; value <= 9; value++) {
-    const previous = cp - value - 1;
-    if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
-      return value;
-    }
-  }
-
-  // Unreachable: every \p{Nd} run start sits within 9 codepoints of its own
-  // digits, so the loop above always returns. Defensive fallback only.
-  // Stryker disable next-line UnaryOperator
-  return -1;
-}
+export function digitValue(char: string): number {}
 
 /**
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected undefined to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:47:7
  * future — with no table to fall out of date.
  */
 export function digitValue(char: string): number {
-  if (!isDigit(char)) return -1;
+  if (true) return -1;
   const cp = char.codePointAt(0);
   // The guard above guarantees a digit, so cp is always defined here.
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:47:7
  * future — with no table to fall out of date.
  */
 export function digitValue(char: string): number {
-  if (!isDigit(char)) return -1;
+  if (false) return -1;
   const cp = char.codePointAt(0);
   // The guard above guarantees a digit, so cp is always defined here.
killedBy: digitValue rejects non-digits
statusReason: expected +0 to be -1 // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:51:7
   const cp = char.codePointAt(0);
   // The guard above guarantees a digit, so cp is always defined here.
   // Stryker disable next-line ConditionalExpression,UnaryOperator
-  if (cp === undefined) return -1;
+  if (cp !== undefined) return -1;
 
   for (let value = 0; value <= 9; value++) {
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected -1 to be +0 // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:53:23
   // Stryker disable next-line ConditionalExpression,UnaryOperator
   if (cp === undefined) return -1;
 
-  for (let value = 0; value <= 9; value++) {
+  for (let value = 0; value < 9; value++) {
     const previous = cp - value - 1;
     if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected -1 to be 9 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:53:44
   // Stryker disable next-line ConditionalExpression,UnaryOperator
   if (cp === undefined) return -1;
 
-  for (let value = 0; value <= 9; value++) {
-    const previous = cp - value - 1;
-    if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
-      return value;
-    }
-  }
+  for (let value = 0; value <= 9; value++) {}
 
   // Unreachable: every \p{Nd} run start sits within 9 codepoints of its own
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected -1 to be +0 // Object.is equality

[Killed] ArithmeticOperator
src/core/detect/numerals.ts:54:22
   if (cp === undefined) return -1;
 
   for (let value = 0; value <= 9; value++) {
-    const previous = cp - value - 1;
+    const previous = cp + value - 1;
     if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
       return value;
killedBy: core/detect/numerals derives digit values from the Unicode block position
statusReason: expected 2 to be 9 // Object.is equality

[Killed] ArithmeticOperator
src/core/detect/numerals.ts:54:22
   if (cp === undefined) return -1;
 
   for (let value = 0; value <= 9; value++) {
-    const previous = cp - value - 1;
+    const previous = cp - value + 1;
     if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
       return value;
killedBy: digitValue reads ASCII digits
statusReason: expected 2 to be +0 // Object.is equality

[Killed] LogicalOperator
src/core/detect/numerals.ts:55:9
 
   for (let value = 0; value <= 9; value++) {
     const previous = cp - value - 1;
-    if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
+    if (previous < 0 && !DIGIT.test(String.fromCodePoint(previous))) {
       return value;
     }
killedBy: digitValue reads ASCII digits
statusReason: expected -1 to be +0 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:55:70
 
   for (let value = 0; value <= 9; value++) {
     const previous = cp - value - 1;
-    if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {
-      return value;
-    }
+    if (previous < 0 || !DIGIT.test(String.fromCodePoint(previous))) {}
   }
 
killedBy: tier B runner produces one observation per post
statusReason: expected null to be 5 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:73:64
  * implausibly large. Zero is null rather than 0 because "0 comments" and "no
  * comments" mean the same thing to every caller here.
  */
-export function extractDigitCount(text: string): number | null {
-  if (!text) return null;
-
-  const cleaned = text.replace(BIDI_CONTROLS, '');
-
-  let result = 0;
-  let started = false;
-
-  for (const char of cleaned) {
-    const value = digitValue(char);
-
-    if (value >= 0) {
-      started = true;
-      result = result * 10 + value;
-      if (result >= PARSER_SANITY_CEILING) return null;
-    } else if (started) {
-      break; // first run only
-    }
-  }
-
-  if (!started || result <= 0) return null;
-
-  return result;
-}
+export function extractDigitCount(text: string): number | null {}
 
 // ============================================================================
killedBy: tier B runner produces one observation per post
statusReason: expected null to be 5 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:74:7
  * comments" mean the same thing to every caller here.
  */
 export function extractDigitCount(text: string): number | null {
-  if (!text) return null;
+  if (true) return null;
 
   const cleaned = text.replace(BIDI_CONTROLS, '');
killedBy: tier B runner produces one observation per post
statusReason: expected null to be 5 // Object.is equality

[Killed] BooleanLiteral
src/core/detect/numerals.ts:74:7
  * comments" mean the same thing to every caller here.
  */
 export function extractDigitCount(text: string): number | null {
-  if (!text) return null;
+  if (text) return null;
 
   const cleaned = text.replace(BIDI_CONTROLS, '');
killedBy: tier B runner produces one observation per post
statusReason: expected null to be 5 // Object.is equality

[Killed] StringLiteral
src/core/detect/numerals.ts:76:47
 export function extractDigitCount(text: string): number | null {
   if (!text) return null;
 
-  const cleaned = text.replace(BIDI_CONTROLS, '');
+  const cleaned = text.replace(BIDI_CONTROLS, "Stryker was here!");
 
   let result = 0;
killedBy: core/detect/numerals strips BiDi controls around RTL numerals before parsing
statusReason: expected 1 to be 12 // Object.is equality

[Killed] BooleanLiteral
src/core/detect/numerals.ts:79:17
   const cleaned = text.replace(BIDI_CONTROLS, '');
 
   let result = 0;
-  let started = false;
+  let started = true;
 
   for (const char of cleaned) {
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected null to be 12 // Object.is equality

[Killed] BlockStatement
src/core/detect/numerals.ts:81:31
   let result = 0;
   let started = false;
 
-  for (const char of cleaned) {
-    const value = digitValue(char);
-
-    if (value >= 0) {
-      started = true;
-      result = result * 10 + value;
-      if (result >= PARSER_SANITY_CEILING) return null;
-    } else if (started) {
-      break; // first run only
-    }
-  }
+  for (const char of cleaned) {}
 
   if (!started || result <= 0) return null;
killedBy: scoreComments detects L0 DOM truth via .qCWAqb .huI6Cb
statusReason: expected +0 to be 100 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:84:9
   for (const char of cleaned) {
     const value = digitValue(char);
 
-    if (value >= 0) {
+    if (false) {
       started = true;
       result = result * 10 + value;
killedBy: scoreComments detects L0 DOM truth via .qCWAqb .huI6Cb
statusReason: expected +0 to be 100 // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:84:9
   for (const char of cleaned) {
     const value = digitValue(char);
 
-    if (value >= 0) {
+    if (value > 0) {
       started = true;
       result = result * 10 + value;
killedBy: StructuralDetector rejects values at or above PLAUSIBLE_COMMENT_COUNT as ids, not counts
statusReason: expected true to be false // Object.is equality

[Killed] BooleanLiteral
src/core/detect/numerals.ts:85:17
     const value = digitValue(char);
 
     if (value >= 0) {
-      started = true;
+      started = false;
       result = result * 10 + value;
       if (result >= PARSER_SANITY_CEILING) return null;
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected null to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/core/detect/numerals.ts:86:16
 
     if (value >= 0) {
       started = true;
-      result = result * 10 + value;
+      result = result * 10 - value;
       if (result >= PARSER_SANITY_CEILING) return null;
     } else if (started) {
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected null to be 5 // Object.is equality

[Killed] ArithmeticOperator
src/core/detect/numerals.ts:86:16
 
     if (value >= 0) {
       started = true;
-      result = result * 10 + value;
+      result = result / 10 + value;
       if (result >= PARSER_SANITY_CEILING) return null;
     } else if (started) {
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected 2.1 to be 12 // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:87:11
     if (value >= 0) {
       started = true;
       result = result * 10 + value;
-      if (result >= PARSER_SANITY_CEILING) return null;
+      if (result > PARSER_SANITY_CEILING) return null;
     } else if (started) {
       break; // first run only
killedBy: core/detect/numerals a run that lands exactly on the parser ceiling is still an id (S12)
statusReason: expected 100000 to be null

[Killed] ConditionalExpression
src/core/detect/numerals.ts:87:11
     if (value >= 0) {
       started = true;
       result = result * 10 + value;
-      if (result >= PARSER_SANITY_CEILING) return null;
+      if (false) return null;
     } else if (started) {
       break; // first run only
killedBy: core/detect/numerals rejects implausibly large runs as ids, not counts
statusReason: expected 9999999999 to be null

[Killed] ConditionalExpression
src/core/detect/numerals.ts:88:16
       started = true;
       result = result * 10 + value;
       if (result >= PARSER_SANITY_CEILING) return null;
-    } else if (started) {
+    } else if (true) {
       break; // first run only
     }
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected null to be 12 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:88:16
       started = true;
       result = result * 10 + value;
       if (result >= PARSER_SANITY_CEILING) return null;
-    } else if (started) {
+    } else if (false) {
       break; // first run only
     }
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected 1234 to be 12 // Object.is equality

[Killed] ConditionalExpression
src/core/detect/numerals.ts:93:7
     }
   }
 
-  if (!started || result <= 0) return null;
+  if (false) return null;
 
   return result;
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected +0 to be null

[Killed] EqualityOperator
src/core/detect/numerals.ts:93:19
     }
   }
 
-  if (!started || result <= 0) return null;
+  if (!started || result < 0) return null;
 
   return result;
killedBy: core/detect/numerals extracts the first digit run and rejects zero
statusReason: expected +0 to be null

[Killed] Regex
src/core/detect/numerals.ts:110:26
 export const MAX_COUNT_CHIP_LENGTH = 32;
 
 /** A count chip is numerals and whitespace only — no separators, no words. */
-const COUNT_CHIP_SHAPE = /^[\p{Nd}\s]*$/u;
+const COUNT_CHIP_SHAPE = /^[^\p{Nd}\s]*$/u;
 
 /** An accepted chip: its count and its cleaned text. */
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) accepts a plain numeral chip in any script
statusReason: expected null to deeply equal { count: 5, text: '5' }

[Killed] Regex
src/core/detect/numerals.ts:110:26
 export const MAX_COUNT_CHIP_LENGTH = 32;
 
 /** A count chip is numerals and whitespace only — no separators, no words. */
-const COUNT_CHIP_SHAPE = /^[\p{Nd}\s]*$/u;
+const COUNT_CHIP_SHAPE = /^[\p{Nd}\s]*/u;
 
 /** An accepted chip: its count and its cleaned text. */
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) rejects timestamp-shaped chips — separators are not chip shape
statusReason: expected { count: 12, text: '12:34' } to be null

[Killed] BlockStatement
src/core/detect/numerals.ts:134:68
  *
  * One definition here, used by both chains, so they cannot drift apart again.
  */
-export function parseCountChip(chipText: string): CountChip | null {
-  const cleaned = normalizeText(chipText);
-  if (!cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
-  if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
-
-  const count = extractDigitCount(cleaned);
-  if (count === null || count >= PLAUSIBLE_COMMENT_COUNT) return null;
-
-  return { count, text: cleaned };
-}
+export function parseCountChip(chipText: string): CountChip | null {}
 
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) accepts a plain numeral chip in any script
statusReason: expected undefined to deeply equal { count: 5, text: '5' }

[Killed] ConditionalExpression
src/core/detect/numerals.ts:136:7
  */
 export function parseCountChip(chipText: string): CountChip | null {
   const cleaned = normalizeText(chipText);
-  if (!cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
+  if (false) return null;
   if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
 
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) a chip one char over the limit is rejected
statusReason: expected { count: 111, …(1) } to be null

[Killed] BooleanLiteral
src/core/detect/numerals.ts:136:7
  */
 export function parseCountChip(chipText: string): CountChip | null {
   const cleaned = normalizeText(chipText);
-  if (!cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
+  if (cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
   if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
 
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) accepts a plain numeral chip in any script
statusReason: expected null to deeply equal { count: 5, text: '5' }

[Killed] ConditionalExpression
src/core/detect/numerals.ts:137:7
 export function parseCountChip(chipText: string): CountChip | null {
   const cleaned = normalizeText(chipText);
   if (!cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
-  if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
+  if (false) return null;
 
   const count = extractDigitCount(cleaned);
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) rejects timestamp-shaped chips — separators are not chip shape
statusReason: expected { count: 12, text: '12:34' } to be null

[Killed] ConditionalExpression
src/core/detect/numerals.ts:137:7
 export function parseCountChip(chipText: string): CountChip | null {
   const cleaned = normalizeText(chipText);
   if (!cleaned || cleaned.length > MAX_COUNT_CHIP_LENGTH) return null;
-  if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
+  if (true) return null;
 
   const count = extractDigitCount(cleaned);
killedBy: StructuralDetector finds a comment count via the DOM-truth container
statusReason: expected false to be true // Object.is equality

[Killed] LogicalOperator
src/core/detect/numerals.ts:140:7
   if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
 
   const count = extractDigitCount(cleaned);
-  if (count === null || count >= PLAUSIBLE_COMMENT_COUNT) return null;
+  if (count === null && count >= PLAUSIBLE_COMMENT_COUNT) return null;
 
   return { count, text: cleaned };
killedBy: StructuralDetector rejects values at or above PLAUSIBLE_COMMENT_COUNT as ids, not counts
statusReason: expected true to be false // Object.is equality

[Killed] EqualityOperator
src/core/detect/numerals.ts:140:25
   if (!COUNT_CHIP_SHAPE.test(cleaned)) return null;
 
   const count = extractDigitCount(cleaned);
-  if (count === null || count >= PLAUSIBLE_COMMENT_COUNT) return null;
+  if (count === null || count < PLAUSIBLE_COMMENT_COUNT) return null;
 
   return { count, text: cleaned };
killedBy: parseCountChip (D5 — chip acceptance for the DOM-truth layers) accepts a plain numeral chip in any script
statusReason: expected null to deeply equal { count: 5, text: '5' }
