[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:277:51
           return {
             state: { ...state, transientRetried: true },
             effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
+              { type: 'begin-strategy', strategy: false ? 'direct' : 'drive-auth', authUser: state.authUser },
               { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
             ],
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:277:51
           return {
             state: { ...state, transientRetried: true },
             effects: [
-              { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
+              { type: 'begin-strategy', strategy: true ? 'direct' : 'drive-auth', authUser: state.authUser },
               { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
             ],
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a drive-auth transient retries as drive-auth with the same authuser
statusReason: expected [ …(2) ] to deeply equal [ …(2) ]

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:278:15
             state: { ...state, transientRetried: true },
             effects: [
               { type: 'begin-strategy', strategy: state.phase === 'direct' ? 'direct' : 'drive-auth', authUser: state.authUser },
-              { type: 'set-deadline', ms: ATTEMPT_DEADLINE_MS },
+              {},
             ],
           };
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a transient failure retries in place once, as direct, with a fresh deadline
statusReason: expected [ Array(2) ] to deeply equal [ …(2) ]

[Killed] LogicalOperator
src/core/acquire/state-machine.ts:282:69
             ],
           };
         }
-        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
+        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail && 'transient' };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
       }
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a second transient failure settles failed with the engine detail
statusReason: expected 'transient' to be 'SERVER_FAILED' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:282:85
             ],
           };
         }
-        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
+        const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? "" };
         return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
       }
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a second transient failure without a detail settles failed "transient"
statusReason: expected '' to be 'transient' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:283:25
           };
         }
         const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+        return { state: {}, effects: settled(state, outcome) };
       }
       break;
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a second transient failure settles failed with the engine detail
statusReason: expected undefined to be 'settled' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:283:16
           };
         }
         const outcome: AcquireOutcome = { status: 'failed', detail: event.detail ?? 'transient' };
-        return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+        return {};
       }
       break;
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) a second transient failure settles failed with the engine detail
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] BlockStatement
src/core/acquire/state-machine.ts:288:33
       break;
     }
 
-    case 'auth-attempt-failed': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      break;
-    }
+    case 'auth-attempt-failed': {}
 
     case 'bypass-tab-opened': {
killedBy: DRIVE_AUTH phase — authuser rotation is data a failed attempt moves to the next unused candidate
statusReason: expected [ +0 ] to deeply equal [ +0, 1 ]

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:288:5
       break;
     }
 
-    case 'auth-attempt-failed': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
-      break;
-    }
+    case 'auth-attempt-failed':
 
     case 'bypass-tab-opened': {
killedBy: DRIVE_AUTH phase — authuser rotation is data a failed attempt moves to the next unused candidate
statusReason: expected [ +0 ] to deeply equal [ +0, 1 ]

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:289:11
     }
 
     case 'auth-attempt-failed': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
+      if (true) return rotateAuthUser(state);
       break;
     }
killedBy: PLANNED phase — strategy-started and inert edges (S12) auth-attempt-failed outside drive-auth is inert
statusReason: expected { phase: 'drive-auth', …(7) } to be { phase: 'direct', …(6) } // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:289:11
     }
 
     case 'auth-attempt-failed': {
-      if (state.phase === 'drive-auth') return rotateAuthUser(state);
+      if (state.phase !== 'drive-auth') return rotateAuthUser(state);
       break;
     }
killedBy: DRIVE_AUTH phase — authuser rotation is data a failed attempt moves to the next unused candidate
statusReason: expected [ +0 ] to deeply equal [ +0, 1 ]

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:293:5
       break;
     }
 
-    case 'bypass-tab-opened': {
-      if (state.phase === 'bypass-tab') {
-        return { state: { ...state, tabId: event.tabId }, effects: [] };
-      }
-      break;
-    }
+    case 'bypass-tab-opened':
 
     case 'saved': {
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: expected 'settled' to be 'bypass-tab' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:293:31
       break;
     }
 
-    case 'bypass-tab-opened': {
-      if (state.phase === 'bypass-tab') {
-        return { state: { ...state, tabId: event.tabId }, effects: [] };
-      }
-      break;
-    }
+    case 'bypass-tab-opened': {}
 
     case 'saved': {
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: expected 'settled' to be 'bypass-tab' // Object.is equality

[Killed] EqualityOperator
src/core/acquire/state-machine.ts:294:11
     }
 
     case 'bypass-tab-opened': {
-      if (state.phase === 'bypass-tab') {
+      if (state.phase !== 'bypass-tab') {
         return { state: { ...state, tabId: event.tabId }, effects: [] };
       }
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: expected undefined to be 21 // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:294:41
     }
 
     case 'bypass-tab-opened': {
-      if (state.phase === 'bypass-tab') {
-        return { state: { ...state, tabId: event.tabId }, effects: [] };
-      }
+      if (state.phase === 'bypass-tab') {}
       break;
     }
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: expected undefined to be 21 // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:295:16
 
     case 'bypass-tab-opened': {
       if (state.phase === 'bypass-tab') {
-        return { state: { ...state, tabId: event.tabId }, effects: [] };
+        return {};
       }
       break;
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:295:25
 
     case 'bypass-tab-opened': {
       if (state.phase === 'bypass-tab') {
-        return { state: { ...state, tabId: event.tabId }, effects: [] };
+        return { state: {}, effects: [] };
       }
       break;
killedBy: PLANNED phase — strategy-started and inert edges (S12) bypass-tab-opened records the tabId
statusReason: expected undefined to be 'bypass-tab' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:300:5
       break;
     }
 
-    case 'saved': {
-      const outcome = saveOutcome(state, event.downloadId);
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'saved':
 
     case 'interrupted': {
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected 'failed' to be 'saved' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:300:19
       break;
     }
 
-    case 'saved': {
-      const outcome = saveOutcome(state, event.downloadId);
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'saved': {}
 
     case 'interrupted': {
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected 'failed' to be 'saved' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:302:14
 
     case 'saved': {
       const outcome = saveOutcome(state, event.downloadId);
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+      return {};
     }
 
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: Cannot read properties of undefined (reading 'phase')

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:302:23
 
     case 'saved': {
       const outcome = saveOutcome(state, event.downloadId);
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+      return { state: {}, effects: settled(state, outcome) };
     }
 
killedBy: BYPASS_TAB phase a save settling from the bypass tab resolves saved
statusReason: expected undefined to be 'settled' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:305:5
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'interrupted': {
-      const outcome: AcquireOutcome = { status: 'failed', detail: event.detail };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'interrupted':
 
     case 'timeout': {
killedBy: terminal guarantees (G6 — no silent deaths) an interrupted download settles failed with the detail
statusReason: expected 'timeout' to be 'failed' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:305:25
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'interrupted': {
-      const outcome: AcquireOutcome = { status: 'failed', detail: event.detail };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'interrupted': {}
 
     case 'timeout': {
killedBy: terminal guarantees (G6 — no silent deaths) an interrupted download settles failed with the detail
statusReason: expected 'timeout' to be 'failed' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:310:5
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'timeout': {
-      const outcome: AcquireOutcome = { status: 'timeout', detail: 'no terminal state before deadline' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'timeout':
 
     case 'cancel': {
killedBy: terminal guarantees (G6 — no silent deaths) timeout force-settles from a live attempt
statusReason: expected 'cancelled' to be 'timeout' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:310:21
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'timeout': {
-      const outcome: AcquireOutcome = { status: 'timeout', detail: 'no terminal state before deadline' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'timeout': {}
 
     case 'cancel': {
killedBy: terminal guarantees (G6 — no silent deaths) timeout force-settles from a live attempt
statusReason: expected 'cancelled' to be 'timeout' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:311:68
     }
 
     case 'timeout': {
-      const outcome: AcquireOutcome = { status: 'timeout', detail: 'no terminal state before deadline' };
+      const outcome: AcquireOutcome = { status: 'timeout', detail: "" };
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
killedBy: DIRECT / DRIVE_AUTH — transient retries, inheritance, settle shape (S12) timeout settles with the honest no-terminal detail
statusReason: expected '' to be 'no terminal state before deadline' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:311:49
     }
 
     case 'timeout': {
-      const outcome: AcquireOutcome = { status: 'timeout', detail: 'no terminal state before deadline' };
+      const outcome: AcquireOutcome = { status: "", detail: 'no terminal state before deadline' };
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
killedBy: terminal guarantees (G6 — no silent deaths) timeout force-settles from a live attempt
statusReason: expected '' to be 'timeout' // Object.is equality

[Killed] ConditionalExpression
src/core/acquire/state-machine.ts:315:5
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'cancel': {
-      const outcome: AcquireOutcome = { status: 'cancelled' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'cancel':
   }
 
killedBy: terminal guarantees (G6 — no silent deaths) a user cancel settles cancelled
statusReason: expected 'bypass-tab' to be 'settled' // Object.is equality

[Killed] BlockStatement
src/core/acquire/state-machine.ts:315:20
       return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
     }
 
-    case 'cancel': {
-      const outcome: AcquireOutcome = { status: 'cancelled' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
-    }
+    case 'cancel': {}
   }
 
killedBy: terminal guarantees (G6 — no silent deaths) a user cancel settles cancelled
statusReason: expected 'bypass-tab' to be 'settled' // Object.is equality

[Killed] StringLiteral
src/core/acquire/state-machine.ts:317:42
 
     case 'cancel': {
       const outcome: AcquireOutcome = { status: 'cancelled' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+      return { state: { ...state, phase: "", outcome }, effects: settled(state, outcome) };
     }
   }
killedBy: terminal guarantees (G6 — no silent deaths) a user cancel settles cancelled
statusReason: expected '' to be 'settled' // Object.is equality

[Killed] ObjectLiteral
src/core/acquire/state-machine.ts:317:23
 
     case 'cancel': {
       const outcome: AcquireOutcome = { status: 'cancelled' };
-      return { state: { ...state, phase: 'settled', outcome }, effects: settled(state, outcome) };
+      return { state: {}, effects: settled(state, outcome) };
     }
   }
killedBy: terminal guarantees (G6 — no silent deaths) a user cancel settles cancelled
statusReason: expected undefined to be 'settled' // Object.is equality
