[Killed] BlockStatement
src/core/name/sanitize.ts:23:74
  * Clean an attachment name: strip trailing type labels, collapse a doubled
  * filename ("file.txtfile.txt") and repeated extensions (".pdf.pdf").
  */
-export function sanitizeFileName(rawName: string, lang?: string): string {
-  if (!rawName) return '';
-  let name = stripTrailingTypeLabel(rawName.trim(), lang);
-
-  // Detect duplicated text (e.g., "file.txtfile.txt")
-  if (name.length > 0 && name.length % 2 === 0) {
-    const mid = name.length / 2;
-    if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
-  }
-
-  // Detect repeated extensions (e.g., ".pdf.pdf")
-  const repeatRegex = /\.([a-zA-Z0-9]{2,10})\1$/i;
-  const repeatMatch = name.match(repeatRegex);
-  if (repeatMatch) return name.slice(0, -repeatMatch[1].length).trim();
-
-  return name;
-}
+export function sanitizeFileName(rawName: string, lang?: string): string {}
 
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected undefined to be 'report.pdf' // Object.is equality

[Killed] BooleanLiteral
src/core/name/sanitize.ts:24:7
  * filename ("file.txtfile.txt") and repeated extensions (".pdf.pdf").
  */
 export function sanitizeFileName(rawName: string, lang?: string): string {
-  if (!rawName) return '';
+  if (rawName) return '';
   let name = stripTrailingTypeLabel(rawName.trim(), lang);
 
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected '' to be 'report.pdf' // Object.is equality

[Killed] ConditionalExpression
src/core/name/sanitize.ts:24:7
  * filename ("file.txtfile.txt") and repeated extensions (".pdf.pdf").
  */
 export function sanitizeFileName(rawName: string, lang?: string): string {
-  if (!rawName) return '';
+  if (true) return '';
   let name = stripTrailingTypeLabel(rawName.trim(), lang);
 
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected '' to be 'report.pdf' // Object.is equality

[Killed] MethodExpression
src/core/name/sanitize.ts:25:37
  */
 export function sanitizeFileName(rawName: string, lang?: string): string {
   if (!rawName) return '';
-  let name = stripTrailingTypeLabel(rawName.trim(), lang);
+  let name = stripTrailingTypeLabel(rawName, lang);
 
   // Detect duplicated text (e.g., "file.txtfile.txt")
killedBy: core/name sanitize — mutation hardening (S12) trims the raw name before stripping (S12)
statusReason: expected 'x.pdf File ' to be 'x.pdf' // Object.is equality

[Killed] ConditionalExpression
src/core/name/sanitize.ts:28:7
   let name = stripTrailingTypeLabel(rawName.trim(), lang);
 
   // Detect duplicated text (e.g., "file.txtfile.txt")
-  if (name.length > 0 && name.length % 2 === 0) {
+  if (false) {
     const mid = name.length / 2;
     if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
killedBy: core/name sanitize collapses doubled filenames and repeated extensions
statusReason: expected 'notes.txtnotes.txt' to be 'notes.txt' // Object.is equality

[Killed] EqualityOperator
src/core/name/sanitize.ts:28:7
   let name = stripTrailingTypeLabel(rawName.trim(), lang);
 
   // Detect duplicated text (e.g., "file.txtfile.txt")
-  if (name.length > 0 && name.length % 2 === 0) {
+  if (name.length <= 0 && name.length % 2 === 0) {
     const mid = name.length / 2;
     if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
killedBy: core/name sanitize collapses doubled filenames and repeated extensions
statusReason: expected 'notes.txtnotes.txt' to be 'notes.txt' // Object.is equality

[Killed] ArithmeticOperator
src/core/name/sanitize.ts:29:17
 
   // Detect duplicated text (e.g., "file.txtfile.txt")
   if (name.length > 0 && name.length % 2 === 0) {
-    const mid = name.length / 2;
+    const mid = name.length * 2;
     if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
   }
killedBy: core/name sanitize collapses doubled filenames and repeated extensions
statusReason: expected 'notes.txtnotes.txt' to be 'notes.txt' // Object.is equality

[Killed] MethodExpression
src/core/name/sanitize.ts:30:56
   // Detect duplicated text (e.g., "file.txtfile.txt")
   if (name.length > 0 && name.length % 2 === 0) {
     const mid = name.length / 2;
-    if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
+    if (name.slice(0, mid) === name.slice(mid)) return name;
   }
 
killedBy: core/name sanitize collapses doubled filenames and repeated extensions
statusReason: expected 'notes.txtnotes.txt' to be 'notes.txt' // Object.is equality

[Killed] ConditionalExpression
src/core/name/sanitize.ts:30:9
   // Detect duplicated text (e.g., "file.txtfile.txt")
   if (name.length > 0 && name.length % 2 === 0) {
     const mid = name.length / 2;
-    if (name.slice(0, mid) === name.slice(mid)) return name.slice(0, mid);
+    if (false) return name.slice(0, mid);
   }
 
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'file.txtfile.txt' to be 'file.txt' // Object.is equality

[Killed] Regex
src/core/name/sanitize.ts:34:23
   }
 
   // Detect repeated extensions (e.g., ".pdf.pdf")
-  const repeatRegex = /\.([a-zA-Z0-9]{2,10})\1$/i;
+  const repeatRegex = /\.([^a-zA-Z0-9]{2,10})\1$/i;
   const repeatMatch = name.match(repeatRegex);
   if (repeatMatch) return name.slice(0, -repeatMatch[1].length).trim();
killedBy: core/name sanitize — mutation hardening (S12) repeated-extension collapse needs a 2-10 char extension
statusReason: expected 'x.abcdefghijabcdefghij' to be 'x.abcdefghij' // Object.is equality

[Killed] MethodExpression
src/core/name/sanitize.ts:36:27
   // Detect repeated extensions (e.g., ".pdf.pdf")
   const repeatRegex = /\.([a-zA-Z0-9]{2,10})\1$/i;
   const repeatMatch = name.match(repeatRegex);
-  if (repeatMatch) return name.slice(0, -repeatMatch[1].length).trim();
+  if (repeatMatch) return name.trim();
 
   return name;
killedBy: core/name sanitize — mutation hardening (S12) repeated-extension collapse needs a 2-10 char extension
statusReason: expected 'x.abcdefghijabcdefghij' to be 'x.abcdefghij' // Object.is equality

[Killed] UnaryOperator
src/core/name/sanitize.ts:36:41
   // Detect repeated extensions (e.g., ".pdf.pdf")
   const repeatRegex = /\.([a-zA-Z0-9]{2,10})\1$/i;
   const repeatMatch = name.match(repeatRegex);
-  if (repeatMatch) return name.slice(0, -repeatMatch[1].length).trim();
+  if (repeatMatch) return name.slice(0, +repeatMatch[1].length).trim();
 
   return name;
killedBy: core/name sanitize — mutation hardening (S12) repeated-extension collapse needs a 2-10 char extension
statusReason: expected 'x.abcdefgh' to be 'x.abcdefghij' // Object.is equality
