[Killed] Regex
src/core/detect/action-buttons.ts:28:3
  * UI button ("Add class comment", "أضف تعليق", …), not a comment indicator.
  */
 export const ACTION_BUTTON_PATTERNS: RegExp[] = [
-  /add\s+(?:class\s+)?comment/i,
+  /add\s+(?:class\S+)?comment/i,
   /(?:اضافة|إضافة|أضف)\s+تعليق/i,
   /اضافة\s+تعليق/i,           // Arabic: Add comment
killedBy: EngineV3 student work API scope does not run API discovery for non-student-work views
statusReason: action-button pattern is not in the canonical table: add\s+(?:class\s+)?comment

[Killed] Regex
src/core/detect/action-buttons.ts:32:3
   /(?:اضافة|إضافة|أضف)\s+تعليق/i,
   /اضافة\s+تعليق/i,           // Arabic: Add comment
   /إضافة\s+تعليق/i,           // Arabic variant
-  /أضف\s+تعليق/i,             // Arabic: Add comment (imperative)
+  /أضف\sتعليق/i,             // Arabic: Add comment (imperative)
   /добавить\s+комментарий/i,  // Russian
   /コメントを追加/i,            // Japanese
killedBy: core/detect/action-buttons is the union of the two historical literal tables
statusReason: أضف\s+تعليق: expected false to be true // Object.is equality

[Killed] Regex
src/core/detect/action-buttons.ts:36:3
   /добавить\s+комментарий/i,  // Russian
   /コメントを追加/i,            // Japanese
   /添加评论/i,                 // Chinese
-  /ajouter.*commentaire/i,    // French
+  /ajouter.commentaire/i,    // French
   /kommentar.*hinzufügen/i,   // German
   /añadir.*comentario/i,      // Spanish
killedBy: core/detect/action-buttons is the union of the two historical literal tables
statusReason: ajouter.*commentaire: expected false to be true // Object.is equality

[Killed] Regex
src/core/detect/action-buttons.ts:38:3
   /添加评论/i,                 // Chinese
   /ajouter.*commentaire/i,    // French
   /kommentar.*hinzufügen/i,   // German
-  /añadir.*comentario/i,      // Spanish
+  /añadir.comentario/i,      // Spanish
   /write.*comment/i,
   /type.*comment/i,
killedBy: core/detect/action-buttons is the union of the two historical literal tables
statusReason: añadir.*comentario: expected false to be true // Object.is equality

[Killed] Regex
src/core/detect/action-buttons.ts:40:3
   /kommentar.*hinzufügen/i,   // German
   /añadir.*comentario/i,      // Spanish
   /write.*comment/i,
-  /type.*comment/i,
+  /type.comment/i,
   /post.*comment/i,
   /new\s+comment/i,
killedBy: core/detect/action-buttons is the union of the two historical literal tables
statusReason: type.*comment: expected false to be true // Object.is equality

[Killed] Regex
src/core/detect/action-buttons.ts:43:3
   /type.*comment/i,
   /post.*comment/i,
   /new\s+comment/i,
-  /leave.*comment/i,
+  /leave.comment/i,
 ];
 
killedBy: core/detect/action-buttons is the union of the two historical literal tables
statusReason: leave.*comment: expected false to be true // Object.is equality

[Killed] ArrowFunction
src/core/detect/action-buttons.ts:47:30
 ];
 
 const CANONICAL_BY_SOURCE: ReadonlyMap<string, RegExp> = new Map(
-  ACTION_BUTTON_PATTERNS.map((pattern) => [pattern.source, pattern]),
+  ACTION_BUTTON_PATTERNS.map(() => undefined),
 );
 
killedBy: smart-detector edited detection detects edited status from .JZk9qf.Vu2fZd span
statusReason: Iterator value undefined is not an entry object

[Killed] ArrayDeclaration
src/core/detect/action-buttons.ts:47:43
 ];
 
 const CANONICAL_BY_SOURCE: ReadonlyMap<string, RegExp> = new Map(
-  ACTION_BUTTON_PATTERNS.map((pattern) => [pattern.source, pattern]),
+  ACTION_BUTTON_PATTERNS.map((pattern) => []),
 );
 
killedBy: core/detect/action-buttons looks patterns up by source and fails loudly on a miss
statusReason: action-button pattern is not in the canonical table: add\s+(?:class\s+)?comment

[Killed] BlockStatement
src/core/detect/action-buttons.ts:58:65
  * re-declaring them. A miss means a rule and the canonical table have
  * drifted apart — a programming error that must fail loudly.
  */
-export function findActionButtonPattern(source: string): RegExp {
-  const pattern = CANONICAL_BY_SOURCE.get(source);
-  if (!pattern) {
-    throw new Error(`action-button pattern is not in the canonical table: ${source}`);
-  }
-  return pattern;
-}
+export function findActionButtonPattern(source: string): RegExp {}
 
killedBy: core/detect/action-buttons looks patterns up by source and fails loudly on a miss
statusReason: Cannot read properties of undefined (reading 'test')

[Killed] BlockStatement
src/core/detect/action-buttons.ts:60:17
  */
 export function findActionButtonPattern(source: string): RegExp {
   const pattern = CANONICAL_BY_SOURCE.get(source);
-  if (!pattern) {
-    throw new Error(`action-button pattern is not in the canonical table: ${source}`);
-  }
+  if (!pattern) {}
   return pattern;
 }
killedBy: core/detect/action-buttons looks patterns up by source and fails loudly on a miss
statusReason: expected [Function] to throw an error

[Killed] ConditionalExpression
src/core/detect/action-buttons.ts:60:7
  */
 export function findActionButtonPattern(source: string): RegExp {
   const pattern = CANONICAL_BY_SOURCE.get(source);
-  if (!pattern) {
+  if (true) {
     throw new Error(`action-button pattern is not in the canonical table: ${source}`);
   }
killedBy: core/detect/action-buttons looks patterns up by source and fails loudly on a miss
statusReason: action-button pattern is not in the canonical table: add\s+(?:class\s+)?comment
