[Killed] BlockStatement
src/core/name/derive.ts:13:67
  * URL is invalid or the segment carries no extension — a caller must not
  * present an extension-less guess as a filename.
  */
-export function deriveFileNameFromUrl(url: string): string | null {
-  if (!url) return null;
-  try {
-    const parsed = new URL(url);
-    const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
-    if (pathName && pathName.includes('.')) return pathName;
-    return null;
-  } catch {
-    return null;
-  }
-}
+export function deriveFileNameFromUrl(url: string): string | null {}
 
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected undefined to be 'notes.txt' // Object.is equality

[Killed] ConditionalExpression
src/core/name/derive.ts:14:7
  * present an extension-less guess as a filename.
  */
 export function deriveFileNameFromUrl(url: string): string | null {
-  if (!url) return null;
+  if (true) return null;
   try {
     const parsed = new URL(url);
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected null to be 'notes.txt' // Object.is equality

[Killed] BooleanLiteral
src/core/name/derive.ts:14:7
  * present an extension-less guess as a filename.
  */
 export function deriveFileNameFromUrl(url: string): string | null {
-  if (!url) return null;
+  if (url) return null;
   try {
     const parsed = new URL(url);
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected null to be 'notes.txt' // Object.is equality

[Killed] BlockStatement
src/core/name/derive.ts:15:7
  */
 export function deriveFileNameFromUrl(url: string): string | null {
   if (!url) return null;
-  try {
-    const parsed = new URL(url);
-    const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
-    if (pathName && pathName.includes('.')) return pathName;
-    return null;
-  } catch {
+  try {} catch {
     return null;
   }
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected undefined to be 'notes.txt' // Object.is equality

[Killed] LogicalOperator
src/core/name/derive.ts:17:41
   if (!url) return null;
   try {
     const parsed = new URL(url);
-    const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
+    const pathName = decodeURIComponent(parsed.pathname.split('/').pop() && '');
     if (pathName && pathName.includes('.')) return pathName;
     return null;
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected null to be 'notes.txt' // Object.is equality

[Killed] ConditionalExpression
src/core/name/derive.ts:17:41
   if (!url) return null;
   try {
     const parsed = new URL(url);
-    const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
+    const pathName = decodeURIComponent(true);
     if (pathName && pathName.includes('.')) return pathName;
     return null;
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected null to be 'notes.txt' // Object.is equality

[Killed] LogicalOperator
src/core/name/derive.ts:18:9
   try {
     const parsed = new URL(url);
     const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
-    if (pathName && pathName.includes('.')) return pathName;
+    if (pathName || pathName.includes('.')) return pathName;
     return null;
   } catch {
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected 'here' to be null

[Killed] ConditionalExpression
src/core/name/derive.ts:18:9
   try {
     const parsed = new URL(url);
     const pathName = decodeURIComponent(parsed.pathname.split('/').pop() || '');
-    if (pathName && pathName.includes('.')) return pathName;
+    if (false) return pathName;
     return null;
   } catch {
killedBy: core/name sanitize derives a filename from a URL path
statusReason: expected null to be 'notes.txt' // Object.is equality
