[Killed] BlockStatement
src/core/name/strip.ts:17:77
 
 import { getTypeLabels } from './type-labels';
 
-export function stripTrailingTypeLabel(name: string, lang?: string): string {
-  const labels = getTypeLabels(lang);
-  const lowerName = name.toLowerCase();
-
-  let best: { stem: string } | null = null;
-  for (const label of labels) {
-    const lowerLabel = label.toLowerCase();
-    if (!lowerName.endsWith(lowerLabel)) continue;
-    if (lowerName.length === lowerLabel.length) continue; // stem would be empty
-    const stem = name.slice(0, name.length - label.length).trim();
-    if (stem.length === 0) continue;
-    // Corroboration: the stem must end in a real extension.
-    if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
-    if (!best || stem.length < best.stem.length) best = { stem };
-  }
-
-  return best ? best.stem : name;
-}
+export function stripTrailingTypeLabel(name: string, lang?: string): string {}
 
killedBy: EngineV2 targeted mutation scans (S11) a single-post mutation scans ONLY the touched post (spied detectFlags)
statusReason: Cannot read properties of undefined (reading 'length')

[Killed] MethodExpression
src/core/name/strip.ts:19:21
 
 export function stripTrailingTypeLabel(name: string, lang?: string): string {
   const labels = getTypeLabels(lang);
-  const lowerName = name.toLowerCase();
+  const lowerName = name.toUpperCase();
 
   let best: { stem: string } | null = null;
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] BlockStatement
src/core/name/strip.ts:22:31
   const lowerName = name.toLowerCase();
 
   let best: { stem: string } | null = null;
-  for (const label of labels) {
-    const lowerLabel = label.toLowerCase();
-    if (!lowerName.endsWith(lowerLabel)) continue;
-    if (lowerName.length === lowerLabel.length) continue; // stem would be empty
-    const stem = name.slice(0, name.length - label.length).trim();
-    if (stem.length === 0) continue;
-    // Corroboration: the stem must end in a real extension.
-    if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
-    if (!best || stem.length < best.stem.length) best = { stem };
-  }
+  for (const label of labels) {}
 
   return best ? best.stem : name;
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] MethodExpression
src/core/name/strip.ts:23:24
 
   let best: { stem: string } | null = null;
   for (const label of labels) {
-    const lowerLabel = label.toLowerCase();
+    const lowerLabel = label.toUpperCase();
     if (!lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] MethodExpression
src/core/name/strip.ts:24:10
   let best: { stem: string } | null = null;
   for (const label of labels) {
     const lowerLabel = label.toLowerCase();
-    if (!lowerName.endsWith(lowerLabel)) continue;
+    if (!lowerName.startsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] BooleanLiteral
src/core/name/strip.ts:24:9
   let best: { stem: string } | null = null;
   for (const label of labels) {
     const lowerLabel = label.toLowerCase();
-    if (!lowerName.endsWith(lowerLabel)) continue;
+    if (lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.p' to be 'report.pdf' // Object.is equality

[Killed] ConditionalExpression
src/core/name/strip.ts:25:9
   for (const label of labels) {
     const lowerLabel = label.toLowerCase();
     if (!lowerName.endsWith(lowerLabel)) continue;
-    if (lowerName.length === lowerLabel.length) continue; // stem would be empty
+    if (true) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
     if (stem.length === 0) continue;
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] EqualityOperator
src/core/name/strip.ts:25:9
   for (const label of labels) {
     const lowerLabel = label.toLowerCase();
     if (!lowerName.endsWith(lowerLabel)) continue;
-    if (lowerName.length === lowerLabel.length) continue; // stem would be empty
+    if (lowerName.length !== lowerLabel.length) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
     if (stem.length === 0) continue;
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] ArithmeticOperator
src/core/name/strip.ts:26:32
     const lowerLabel = label.toLowerCase();
     if (!lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
-    const stem = name.slice(0, name.length - label.length).trim();
+    const stem = name.slice(0, name.length + label.length).trim();
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] MethodExpression
src/core/name/strip.ts:26:18
     const lowerLabel = label.toLowerCase();
     if (!lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
-    const stem = name.slice(0, name.length - label.length).trim();
+    const stem = name.slice(0, name.length - label.length);
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] ConditionalExpression
src/core/name/strip.ts:27:9
     if (!lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
-    if (stem.length === 0) continue;
+    if (true) continue;
     // Corroboration: the stem must end in a real extension.
     if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] EqualityOperator
src/core/name/strip.ts:27:9
     if (!lowerName.endsWith(lowerLabel)) continue;
     if (lowerName.length === lowerLabel.length) continue; // stem would be empty
     const stem = name.slice(0, name.length - label.length).trim();
-    if (stem.length === 0) continue;
+    if (stem.length !== 0) continue;
     // Corroboration: the stem must end in a real extension.
     if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] ConditionalExpression
src/core/name/strip.ts:29:9
     const stem = name.slice(0, name.length - label.length).trim();
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
-    if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
+    if (true) continue;
     if (!best || stem.length < best.stem.length) best = { stem };
   }
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality

[Killed] BooleanLiteral
src/core/name/strip.ts:29:9
     const stem = name.slice(0, name.length - label.length).trim();
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
-    if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
+    if (/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
     if (!best || stem.length < best.stem.length) best = { stem };
   }
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'report.pdf Microsoft' to be 'report.pdf' // Object.is equality

[Killed] BooleanLiteral
src/core/name/strip.ts:30:9
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
     if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
-    if (!best || stem.length < best.stem.length) best = { stem };
+    if (best || stem.length < best.stem.length) best = { stem };
   }
 
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: Cannot read properties of null (reading 'stem')

[Killed] ConditionalExpression
src/core/name/strip.ts:30:9
     if (stem.length === 0) continue;
     // Corroboration: the stem must end in a real extension.
     if (!/\.[a-zA-Z0-9]{1,10}$/.test(stem)) continue;
-    if (!best || stem.length < best.stem.length) best = { stem };
+    if (false) best = { stem };
   }
 
killedBy: content file meta cleans garbage labels and duplicated names
statusReason: expected 'report.pdf Microsoft Word' to be 'report.pdf' // Object.is equality
