[Killed] StringLiteral
src/core/name/type-labels.ts:22:3
  */
 
 const ENGLISH_TYPE_LABELS: ReadonlySet<string> = new Set([
-  'Microsoft Excel',
+  "",
   'Microsoft Word',
   'Microsoft PowerPoint',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 's.xlsMicrosoft Excel' to be 's.xls' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:24:3
 const ENGLISH_TYPE_LABELS: ReadonlySet<string> = new Set([
   'Microsoft Excel',
   'Microsoft Word',
-  'Microsoft PowerPoint',
+  "",
   'Compressed archive',
   'Binary',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 'a.pptxMicrosoft PowerPoint' to be 'a.pptx' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:31:3
   'Google Sheets',
   'Google Docs',
   'Google Slides',
-  'Text File',
+  "",
   'PDF',
   'Video',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 't.txtText' to be 't.txt' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:33:3
   'Google Slides',
   'Text File',
   'PDF',
-  'Video',
+  "",
   'Image',
   'Audio',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 'v.mp4Video' to be 'v.mp4' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:36:3
   'Video',
   'Image',
   'Audio',
-  'Text',
+  "",
   'Word',
   'Excel',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 'n.mdText' to be 'n.md' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:38:3
   'Audio',
   'Text',
   'Word',
-  'Excel',
+  "",
   'PowerPoint',
   'Archive',
killedBy: core/name sanitize — mutation hardening (S12) strips every English label that had no dedicated case
statusReason: expected 'a.xlsExcel' to be 'a.xls' // Object.is equality

[Survived] StringLiteral
src/core/name/type-labels.ts:41:3
   'Excel',
   'PowerPoint',
   'Archive',
-  'Zip',
+  "",
   'File',
   'Document',

[Killed] StringLiteral
src/core/name/type-labels.ts:43:3
   'Archive',
   'Zip',
   'File',
-  'Document',
+  "",
   'Shortcut',
   'Code',
killedBy: core/name sanitize — properties strips every glued label when a real extension precedes it (100 cases)
statusReason: expected '略前前前イx.xlsxDocument' to be '略前前前イx.xlsx' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:51:5
 /** Classroom/Drive attachment type labels by UI locale, lowercase keys. */
 const TYPE_LABELS_BY_LOCALE: Readonly<Record<string, ReadonlySet<string>>> = {
   hu: new Set([
-    'Tömörített archívum',
+    "",
     'Google-dokumentumok',
     'Google-táblázatok',
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: expected 'example.zipTömörített archívum' to be 'example.zip' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:53:5
   hu: new Set([
     'Tömörített archívum',
     'Google-dokumentumok',
-    'Google-táblázatok',
+    "",
     'Google-prezentáció',
     'Google-űrlapok',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Google-táblázatok: expected 'a.pdfGoogle-táblázatok' to be 'a.pdf' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:56:5
     'Google-táblázatok',
     'Google-prezentáció',
     'Google-űrlapok',
-    'Google-rajz',
+    "",
     'Saját Drive',
     'Szöveges dokumentum',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Google-rajz: expected 'a.pdfGoogle-rajz' to be 'a.pdf' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:62:5
     'Szövegfájl',
     'Bináris fájl',
     'Bináris',
-    'Ismeretlen',
+    "",
     'Dokumentum',
     'Fájl',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Ismeretlen: expected 'a.binIsmeretlen' to be 'a.bin' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:66:5
     'Dokumentum',
     'Fájl',
     'Táblázat',
-    'Prezentáció',
+    "",
     'Űrlap',
     'Rajz',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Prezentáció: expected 'a.pptxPrezentáció' to be 'a.pptx' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:70:5
     'Űrlap',
     'Rajz',
     'Mappa',
-    'Videó',
+    "",
     'Kép',
     'Hang',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Videó: expected 'a.mp4Videó' to be 'a.mp4' // Object.is equality

[Killed] StringLiteral
src/core/name/type-labels.ts:73:5
     'Videó',
     'Kép',
     'Hang',
-    'Szöveg',
+    "",
     'Parancsikon',
     'Kód',
killedBy: core/name sanitize — mutation hardening (S12) strips every Hungarian locale label (S12 sweep)
statusReason: Szöveg: expected 'a.txtSzöveg' to be 'a.txt' // Object.is equality

[Killed] BlockStatement
src/core/name/type-labels.ts:86:56
  * extension-corroborated strip in the caller is what protects real
  * filenames, so an unknown locale must not leave the label glued on.
  */
-export function getTypeLabels(lang?: string): string[] {
-  const labels = new Set<string>(ENGLISH_TYPE_LABELS);
-  const locale = (lang || '').trim().toLowerCase().split('-')[0];
-  const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
-  if (table) {
-    for (const label of table) labels.add(label);
-  } else if (!locale) {
-    for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
-      for (const label of localized) labels.add(label);
-    }
-  }
-  return [...labels];
-}
+export function getTypeLabels(lang?: string): string[] {}
 
killedBy: EngineV2 targeted mutation scans (S11) a single-post mutation scans ONLY the touched post (spied detectFlags)
statusReason: labels is not iterable

[Killed] LogicalOperator
src/core/name/type-labels.ts:88:19
  */
 export function getTypeLabels(lang?: string): string[] {
   const labels = new Set<string>(ENGLISH_TYPE_LABELS);
-  const locale = (lang || '').trim().toLowerCase().split('-')[0];
+  const locale = (lang && '').trim().toLowerCase().split('-')[0];
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
   if (table) {
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: Cannot read properties of undefined (reading 'trim')

[Killed] ConditionalExpression
src/core/name/type-labels.ts:88:19
  */
 export function getTypeLabels(lang?: string): string[] {
   const labels = new Set<string>(ENGLISH_TYPE_LABELS);
-  const locale = (lang || '').trim().toLowerCase().split('-')[0];
+  const locale = (false).trim().toLowerCase().split('-')[0];
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
   if (table) {
killedBy: EngineV2 targeted mutation scans (S11) a single-post mutation scans ONLY the touched post (spied detectFlags)
statusReason: (intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value)(intermediate value).trim is not a function

[Killed] ConditionalExpression
src/core/name/type-labels.ts:90:7
   const labels = new Set<string>(ENGLISH_TYPE_LABELS);
   const locale = (lang || '').trim().toLowerCase().split('-')[0];
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
-  if (table) {
+  if (true) {
     for (const label of table) labels.add(label);
   } else if (!locale) {
killedBy: core/name sanitize strips a trailing type label only when the stem keeps its extension
statusReason: table is not iterable

[Killed] ConditionalExpression
src/core/name/type-labels.ts:90:7
   const labels = new Set<string>(ENGLISH_TYPE_LABELS);
   const locale = (lang || '').trim().toLowerCase().split('-')[0];
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
-  if (table) {
+  if (false) {
     for (const label of table) labels.add(label);
   } else if (!locale) {
killedBy: content file meta strips a localized label glued to the extension (D10 Hungarian report)
statusReason: expected 'example.zipTömörített archívum' to be 'example.zip' // Object.is equality

[Killed] CallExpression
src/core/name/type-labels.ts:91:32
   const locale = (lang || '').trim().toLowerCase().split('-')[0];
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
   if (table) {
-    for (const label of table) labels.add(label);
+    for (const label of table) ;
   } else if (!locale) {
     for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
killedBy: content file meta strips a localized label glued to the extension (D10 Hungarian report)
statusReason: expected 'example.zipTömörített archívum' to be 'example.zip' // Object.is equality

[Killed] ConditionalExpression
src/core/name/type-labels.ts:92:14
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
   if (table) {
     for (const label of table) labels.add(label);
-  } else if (!locale) {
+  } else if (true) {
     for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
       for (const label of localized) labels.add(label);
killedBy: core/name sanitize — mutation hardening (S12) a known locale without a table gets English only; absent locale merges all
statusReason: expected [ 'Microsoft Excel', …(48) ] to not include 'Tömörített archívum'

[Killed] ConditionalExpression
src/core/name/type-labels.ts:92:14
   const table = locale ? TYPE_LABELS_BY_LOCALE[locale] : undefined;
   if (table) {
     for (const label of table) labels.add(label);
-  } else if (!locale) {
+  } else if (false) {
     for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
       for (const label of localized) labels.add(label);
killedBy: core/name sanitize — mutation hardening (S12) a known locale without a table gets English only; absent locale merges all
statusReason: expected [ 'Microsoft Excel', …(23) ] to include 'Tömörített archívum'

[Killed] BlockStatement
src/core/name/type-labels.ts:93:67
   if (table) {
     for (const label of table) labels.add(label);
   } else if (!locale) {
-    for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
-      for (const label of localized) labels.add(label);
-    }
+    for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {}
   }
   return [...labels];
killedBy: core/name sanitize — mutation hardening (S12) a known locale without a table gets English only; absent locale merges all
statusReason: expected [ 'Microsoft Excel', …(23) ] to include 'Tömörített archívum'

[Killed] CallExpression
src/core/name/type-labels.ts:94:38
     for (const label of table) labels.add(label);
   } else if (!locale) {
     for (const localized of Object.values(TYPE_LABELS_BY_LOCALE)) {
-      for (const label of localized) labels.add(label);
+      for (const label of localized) ;
     }
   }
killedBy: core/name sanitize — mutation hardening (S12) a known locale without a table gets English only; absent locale merges all
statusReason: expected [ 'Microsoft Excel', …(23) ] to include 'Tömörített archívum'
