[Killed] BlockStatement
src/core/name/verify.ts:12:64
  * The file extension of a name, lowercase — or null when the name does not
  * end in a plausible extension (dot + 1-10 alphanumerics at end of string).
  */
-export function fileNameExtension(name: string): string | null {
-  const m = name.match(/\.([a-zA-Z0-9]{1,10})$/);
-  return m ? m[1].toLowerCase() : null;
-}
+export function fileNameExtension(name: string): string | null {}
 
 /** True when the name ends in a plausible file extension. */
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected undefined to be 'pdf' // Object.is equality

[Killed] Regex
src/core/name/verify.ts:13:24
  * end in a plausible extension (dot + 1-10 alphanumerics at end of string).
  */
 export function fileNameExtension(name: string): string | null {
-  const m = name.match(/\.([a-zA-Z0-9]{1,10})$/);
+  const m = name.match(/\.([a-zA-Z0-9])$/);
   return m ? m[1].toLowerCase() : null;
 }
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected null to be 'pdf' // Object.is equality

[Killed] MethodExpression
src/core/name/verify.ts:14:14
  */
 export function fileNameExtension(name: string): string | null {
   const m = name.match(/\.([a-zA-Z0-9]{1,10})$/);
-  return m ? m[1].toLowerCase() : null;
+  return m ? m[1].toUpperCase() : null;
 }
 
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected 'PDF' to be 'pdf' // Object.is equality

[Killed] BlockStatement
src/core/name/verify.ts:18:57
 }
 
 /** True when the name ends in a plausible file extension. */
-export function hasFileExtension(name: string): boolean {
-  return fileNameExtension(name) !== null;
-}
+export function hasFileExtension(name: string): boolean {}
 
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected undefined to be true // Object.is equality

[Killed] ConditionalExpression
src/core/name/verify.ts:19:10
 
 /** True when the name ends in a plausible file extension. */
 export function hasFileExtension(name: string): boolean {
-  return fileNameExtension(name) !== null;
+  return true;
 }
 
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected true to be false // Object.is equality

[Killed] ConditionalExpression
src/core/name/verify.ts:19:10
 
 /** True when the name ends in a plausible file extension. */
 export function hasFileExtension(name: string): boolean {
-  return fileNameExtension(name) !== null;
+  return false;
 }
 
killedBy: core/name sanitize extracts and verifies extensions
statusReason: expected false to be true // Object.is equality
