[Killed] StringLiteral
src/core/detect/normalize.ts:22:5
 /** Invisible directionality and zero-width characters that corrupt matching. */
 export const BIDI_CONTROL_CHARS: RegExp = new RegExp(
   '[' +
-    '\u200B\u200C\u200D' + // Zero-width spaces/joiners
+    "" + // Zero-width spaces/joiners
     '\u200E\u200F' +       // LTR/RTL marks
     '\u202A-\u202E' +      // Directional embeddings/overrides
killedBy: normalizeText() BiDi Control Characters Removal should strip Zero-width chars
statusReason: expected '​test\u200c' to be 'test' // Object.is equality

[Killed] StringLiteral
src/core/detect/normalize.ts:30:3
     '\uFEFF' +             // BOM
     '\u00AD' +             // Soft hyphen
   ']',
-  'gu'
+  ""
 );
 
killedBy: core/detect/normalize strips invisible BiDi control characters
statusReason: expected '5\u200f comments\u202a\u202c' to be '5 comments' // Object.is equality

[Killed] BlockStatement
src/core/detect/normalize.ts:44:53
  * Normalizes text by stripping invisible BiDi control characters.
  * ALL scanning MUST pass through this function.
  */
-export function normalizeText(text: string): string {
-  if (!text) return '';
-  return text
-    .replace(BIDI_CONTROL_CHARS, '')
-    .replace(WHITESPACE_VARIANTS, ' ')
-    .replace(/\s+/g, ' ')
-    .trim();
-}
+export function normalizeText(text: string): string {}
 
 /**
killedBy: core/detect/normalize strips invisible BiDi control characters
statusReason: expected undefined to be '5 comments' // Object.is equality

[Killed] ConditionalExpression
src/core/detect/normalize.ts:45:7
  * ALL scanning MUST pass through this function.
  */
 export function normalizeText(text: string): string {
-  if (!text) return '';
+  if (false) return '';
   return text
     .replace(BIDI_CONTROL_CHARS, '')
killedBy: normalizeText() should handle null/undefined gracefully
statusReason: Cannot read properties of null (reading 'replace')

[Killed] ConditionalExpression
src/core/detect/normalize.ts:45:7
  * ALL scanning MUST pass through this function.
  */
 export function normalizeText(text: string): string {
-  if (!text) return '';
+  if (true) return '';
   return text
     .replace(BIDI_CONTROL_CHARS, '')
killedBy: core/detect/normalize strips invisible BiDi control characters
statusReason: expected '' to be '5 comments' // Object.is equality

[Killed] MethodExpression
src/core/detect/normalize.ts:46:10
  */
 export function normalizeText(text: string): string {
   if (!text) return '';
-  return text
-    .replace(BIDI_CONTROL_CHARS, '')
-    .replace(WHITESPACE_VARIANTS, ' ')
-    .replace(/\s+/g, ' ')
-    .trim();
+  return text.replace(BIDI_CONTROL_CHARS, '').replace(WHITESPACE_VARIANTS, ' ').replace(/\s+/g, ' ');
 }
 
killedBy: core/detect/normalize collapses runs of whitespace and trims
statusReason: expected ' 5 comments ' to be '5 comments' // Object.is equality

[Killed] StringLiteral
src/core/detect/normalize.ts:47:34
 export function normalizeText(text: string): string {
   if (!text) return '';
   return text
-    .replace(BIDI_CONTROL_CHARS, '')
+    .replace(BIDI_CONTROL_CHARS, "Stryker was here!")
     .replace(WHITESPACE_VARIANTS, ' ')
     .replace(/\s+/g, ' ')
killedBy: core/detect/normalize strips invisible BiDi control characters
statusReason: expected 'Stryker was here!5Stryker was here! c…' to be '5 comments' // Object.is equality

[Killed] StringLiteral
src/core/detect/normalize.ts:49:22
   return text
     .replace(BIDI_CONTROL_CHARS, '')
     .replace(WHITESPACE_VARIANTS, ' ')
-    .replace(/\s+/g, ' ')
+    .replace(/\s+/g, "")
     .trim();
 }
killedBy: core/detect/normalize strips invisible BiDi control characters
statusReason: expected '5comments' to be '5 comments' // Object.is equality

[Killed] BlockStatement
src/core/detect/normalize.ts:61:62
  * matches its undiacritic'd table entry without every form being hand-listed
  * (D7).
  */
-export function normalizeForComparison(text: string): string {
-  return normalizeText(text)
-    .toLowerCase()
-    .replace(/[\u064B-\u0652\u0670]/g, '')
-    .replace(/[()[\]{}.,،!?:;'"]/g, '')
-    .trim();
-}
+export function normalizeForComparison(text: string): string {}
 
killedBy: core/detect/normalize lowercases and strips punctuation for comparison
statusReason: expected undefined to be 'hello world' // Object.is equality

[Killed] MethodExpression
src/core/detect/normalize.ts:62:10
  * (D7).
  */
 export function normalizeForComparison(text: string): string {
-  return normalizeText(text)
-    .toLowerCase()
+  return normalizeText(text).toUpperCase()
     .replace(/[\u064B-\u0652\u0670]/g, '')
     .replace(/[()[\]{}.,،!?:;'"]/g, '')
killedBy: core/detect/normalize lowercases and strips punctuation for comparison
statusReason: expected 'HELLO WORLD' to be 'hello world' // Object.is equality

[Survived] MethodExpression
src/core/detect/normalize.ts:62:10
  * (D7).
  */
 export function normalizeForComparison(text: string): string {
-  return normalizeText(text)
-    .toLowerCase()
-    .replace(/[\u064B-\u0652\u0670]/g, '')
-    .replace(/[()[\]{}.,،!?:;'"]/g, '')
-    .trim();
+  return normalizeText(text).toLowerCase().replace(/[\u064B-\u0652\u0670]/g, '').replace(/[()[\]{}.,،!?:;'"]/g, '');
 }
 
